{
  "part": "F",
  "title": "RELATIONS WITH MAJLIS-E-SHOORA (PARLIAMENT)",
  "rules": [
    {
      "number": "31",
      "title": "Compliance with Rules of Majlis-e-Shoora (Parliament)",
      "content": "All Divisions shall, in their relations with the Assembly, the Senate and Majlis-e-Shoora (Parliament) in joint sitting comply with the Rules of Procedure and Standing Orders of the Assembly, the Senate or the joint sitting, as the case may be."
    },
    {
      "number": "32",
      "title": "Summoning of Majlis-e-Shoora (Parliament), a House or Joint Sitting by the President",
      "content": "(1) At the appropriate time, the Secretary Parliamentary Affairs Division shall ascertain the state of business pending for consideration of the Assembly, the Senate or Joint sitting.\n\n(2) The Secretary Parliamentary Affairs Division, shall in terms of rule 15-A, obtain the President's orders on summoning the Assembly, the Senate, both Houses or Majlis-e-Shoora (Parliament) in joint sitting, as the case may be, and communicate the date, time and place of the commencement of the session--\n(a) in the case of the Assembly, to the Secretary of the Assembly;\n(b) in the case of the Senate, to the Secretary of the Senate;\n(c) in the case of both Houses and joint sitting, to the Secretary of the Assembly and also to the Secretary of the Senate;\n\n(3) Upon receipt of a communication under sub-rule (2), the date, time and place for the commencement of the session shall be notified in the Gazette--\n(a) in the case of the Assembly, by the Secretary of the Assembly;\n(b) in the case of the Senate, by the Secretary of the Senate;\n(c) in the case of both Houses or joint sitting, by the Secretary of the Assembly and also by the Secretary of the Senate."
    },
    {
      "number": "33",
      "title": "Prorogation of Majlis-e-Shoora (Parliament), a House, or Joint Sitting by the President",
      "content": "(1) At the appropriate time, the Secretary Parliamentary Affairs Division shall, in terms of rule 15-A, obtain the President's orders on prorogation of the Assembly, the Senate, both Houses or Majlis-e-Shoora (Parliament) in joint sitting, as the case may be and communicate the same--\n(a) in the case of the Assembly, to the Secretary of the Assembly;\n(b) in the case of the Senate, to the Secretary of the Senate;\n(c) in the case of both Houses and joint sitting, to the Secretary of the Assembly and also to the Secretary of the Senate.\n\n(2) Upon receipt of a communication under sub-rule (1), the date of prorogation of the session shall be notified in the Gazette--\n(a) in the case of the Assembly, by the Secretary of the Assembly;\n(b) in the case of the Senate, by the Secretary of the Senate;\n(c) in the case of both Houses and joint sitting, by the Secretary of the Assembly and also by the Secretary of the Senate."
    },
    {
      "number": "34",
      "title": "Summoning and Prorogation of National Assembly by the Speaker",
      "content": "(1) When the Assembly is summoned by the Speaker under clause (3) of Article 54, the date, time and place for the commencement of the session shall be notified in the Gazette by the Secretary of the Assembly.\n\n(2) When the Assembly is prorogued by the Speaker under clause (3) of Article 54, the date of prorogation shall be notified in the Gazette by the Secretary of the Assembly."
    },
    {
      "number": "36",
      "title": "Review of Official and Non-Official Business",
      "content": "As soon as a notification under sub-rule (3) of rule 32, sub-rule (1) of rule 34, or sub-rule (1) of rule 35 is issued, all Divisions shall undertake a review of official and non-official business intended to be brought before the Assembly, the Senate, both Houses or the joint sitting, as the case may be, and shall promptly forward to the Parliamentary Affairs Division detailed lists of such business, not later than five days before the commencement of the session."
    },
    {
      "number": "37",
      "title": "Provisional Forecast of Official and Non-Official Business",
      "content": "The Secretary Parliamentary Affairs Division shall prepare a provisional forecast of the business to be brought before the Assembly, the Senate or the joint sitting, as the case may be and shall make, through the appropriate Leader of the House, or in the case of the joint sitting, through the Prime Minister, proposals to the Speaker or, as the case may be, the Chairman for the allotment of days for the transaction of official as well as non-official business. The final arrangement as approved by the Speaker or, the Chairman as the case may be, shall be circulated by the appropriate Secretariat to all the Divisions and the Secretary, Prime Minister's Office."
    },
    {
      "number": "38",
      "title": "Orders of the Day",
      "content": "The Secretary Parliamentary Affairs Division, shall, in consultation with the appropriate Leader of the House, prepare orders of the day for each official day and forward it to the appropriate Secretariat. In the case of a joint sitting, the Orders of the Day shall be prepared in consultation with the Prime Minister and forwarded to the Secretary of the Assembly."
    },
    {
      "number": "39",
      "title": "Transmission of Bills, etc.",
      "content": "(1) Copies of Bills, including Bills passed by one House and transmitted to the other House, Bills to be reconsidered by the Assembly and Bills to be considered in a joint sitting, resolutions, notices, questions and other business to be brought before the Assembly, the Senate or the joint sitting shall be forwarded as soon as received or possible, by the appropriate Secretariat to the Division concerned.\n\n(2) If a Bill, resolution, motion or question has been wrongly addressed to a Division by the appropriate Secretariat, it shall be promptly transferred by the receiving Division to the Division concerned, under advice to that Secretariat.\n\n(3) The appropriate Secretariat shall inform the Division concerned as soon as it is known that a resolution, motion or question has been admitted in its final form or not admitted so that the Division concerned may regulate its action accordingly.\n\n(4) Before the commencement of each session of the National Assembly or the Senate, the appropriate Secretariat shall ascertain from the Cabinet Division the allocation of business amongst the Divisions."
    },
    {
      "number": "40",
      "title": "Action by Divisions",
      "content": "As soon as any communication (whether a notice, intimation, a Bill or any other paper) is received from the appropriate Secretariat or any other authority regarding the business or affairs of the Assembly, the Senate or the joint sitting, the receiving officer shall at once bring it to the notice of the Secretary and the Minister."
    },
    {
      "number": "41",
      "title": "Introduction of Bills, etc.",
      "content": "(1) A Money Bill shall originate in the National Assembly:\nProvided that simultaneously when a Money Bill including the Finance Bill containing the Annual Budget Statement is presented in the National Assembly, a copy thereof shall be transmitted to the Senate which may, within fourteen days, make recommendations thereon to the National Assembly.\n\n(1A) The National Assembly shall consider the recommendations of the Senate and, after the Bill has been passed by the Assembly with or without incorporating the recommendations of the Senate, it shall be presented to the President for assent.\n\n(2) Bills, other than Money Bills, resolutions, motions, questions or other business with respect to any matter in the Federal Legislative List originate or be moved or asked, in or, as the case may be, brought before either House:\nProvided that the Prime Minister shall determine the House in which a particular official bill, resolution or motion originate or be moved or, as the case may be, before which any other official business shall be brought.\n\n(3) Omitted vide S.R.O. No. 822(I)/2002, dated 20.11.2002.\n\n(4) An official Bill shall be introduced in the Assembly, or as the case may be, the Senate by the Minister-in-Charge or by any other Minister on his behalf.\n\n(5) The Minister concerned shall in consultation with the Leader of the House, decide as to which of the following motion should be made with regard to an official Bill after its introduction,--\n(a) that it be taken into consideration at once and passed; or\n(b) that it be taken into consideration on a date to be specified; or\n(c) that it be referred to a Select Committee; or\n(d) that it be circulated for the purpose of eliciting opinion thereon:\nProvided that if a question of important policy is involved, the Minister shall obtain the orders of the Prime Minister.\n\n(6) Omitted vide SRO No. 822(I)/2002, dated 20.11.2002.\n\n(7) The Division concerned shall prepare for the use of the Minister-in-Charge a brief of each Bill, whether official or non-official."
    },
    {
      "number": "42",
      "title": "Assent to Bills",
      "content": "A Bill to be presented to the President for his assent shall be forwarded by the appropriate Secretariat duly certified by the Speaker or, as the case may be, the Chairman to the Parliamentary Affairs Division who shall submit it to the President for his assent. The President shall--\n(a) assent to the Bill, or\n(b) if it is a Bill other than a Money Bill, return the Bill to the Majlis-e-Shoora (Parliament) with a message requesting that the Bill, or any specified provision thereof, be reconsidered and that any amendments specified in the message be considered."
    },
    {
      "number": "142A",
      "title": "Reconsideration of Bill by Majlis-e-Shoora (Parliament)",
      "content": "When the President has returned a Bill to the Majlis-e-Shoora (Parliament), it shall be reconsidered by the Majlis-e-Shoora (Parliament) in joint sitting and if it is passed by the votes of the majority of the members of both Houses present and voting, it shall be deemed for the purposes of the Constitution to have been passed by both Houses and shall be presented to the President, and the President shall give his assent within ten days, failing which such assent shall be deemed to have been given."
    },
    {
      "number": "43",
      "title": "Resolutions",
      "content": "(1) When an official resolution is to be moved in the Assembly, the Senate or the joint sitting, the Division concerned shall, where time permits, consult the Law and Justice Division and obtain approval of the Cabinet, before forwarding the resolution with a notice signed by the Minister to the Secretary of the appropriate Secretariat:\nProvided that no such resolution shall be forwarded to the appropriate Secretariat until the Prime Minister has seen it if he was not present at the Cabinet meeting, or where there was no time to consult the Cabinet.\nNote:- Official resolutions may be for the ratification of an international convention, constitution of a statutory body, declaration of policy on a matter of public interest, etc.\n\n(2) On receipt of a non-official resolution from the appropriate Secretariat, the Division concerned shall examine its contents and, when the resolution is admitted for discussion, obtain the orders of the Cabinet if time permits. But the orders of the Prime Minister shall in any case be obtained. In examining the resolution, the Division concerned shall consider whether the discussion of the resolution, or any part thereof, would be detrimental to the public interest and if so, it should point this out with reasons in its comments on the resolution.\n\n(3) The Division concerned shall prepare regarding each resolution, whether official or non-official, a brief for the use of the Minister.\n\n(4) After a resolution has been adopted, the appropriate Secretariat shall forward it to the Division concerned for appropriate action."
    },
    {
      "number": "44",
      "title": "Motions",
      "content": "(1) The Division concerned shall submit an official motion, together with a notice, to the Minister-in-Charge and after he has signed it, shall forward it to the appropriate Secretariat.\nNote:- Official motions may be for the election of members to a Standing Committee or a statutory body, raising discussion on a particular matter, etc.\n\n(2) On receipt of a non-official motion from the appropriate Secretariat, the Division concerned shall consider whether a discussion of the motion, or any part thereof, would be detrimental to the public interest.\n\n(3) If the Division is of opinion that discussion of a motion or any part thereof would be detrimental to the public interest or that the motion or any part thereof involves a point of important policy which requires the orders of the Prime Minister or the Cabinet under these rules, it shall, as soon as the motion is admitted, submit the case for the orders of the Prime Minister or, as the case may be, the Cabinet and shall in doing so state the reasons for holding such opinion.\n\n(4) The Division concerned shall prepare regarding each motion, whether official or non-official, a brief for the use of the Minister.\n\n(5) After a motion has been adopted, the appropriate Secretariat shall forward it to the Division concerned for appropriate action."
    },
    {
      "number": "45",
      "title": "Questions",
      "content": "(1) On receipt, from the appropriate Secretariat, of a question (starred, un-starred or short notice) proposed to be asked by a member, the Division concerned shall draft a reply and after it has been approved by the Minister forward the required number of copies of the reply to the appropriate Secretariat before the day on which the question is put down for answer. In the case of a starred question, a brief be prepared by the Division concerned for the use of the Minister in answering any supplementary question that may be asked.\n\n(2) A copy of each supplementary question asked in respect of a starred question, and of the reply given thereto, shall be forwarded by the appropriate Secretariat to the Division concerned, as soon as possible after the proceedings have been transcribed.\n\n(3) The Division concerned shall be responsible for the fulfilment of any undertakings given on its behalf in reply to a question or a supplementary question."
    },
    {
      "number": "46",
      "title": "Budget",
      "content": "(1) The Minister for Finance shall, in consultation with the Prime Minister and the Speaker, prepare a time-table for the consideration of annual budget by the Assembly. The Secretary of the Assembly shall intimate the time-table so decided upon to all the Divisions and the Secretary, Prime Minister's Office.\n\n(2) On receipt of a motion proposing a cut in a demand (or supplementary demand) for grant of funds, the Division concerned shall examine the points raised by the member, and any further points likely to be raised, and prepare a brief for the use of the Minister-in-Charge in making a reply.\n\n(3) When the budget is passed by the Assembly, the Minister for Finance shall submit the Schedule of Authorized Expenditure to the Prime Minister who shall authenticate the Schedule by his signature as required by Article 83."
    },
    {
      "number": "47",
      "title": "Committees of Assembly or Senate",
      "content": "Standing or ad-hoc Committees may be constituted by the Assembly or the Senate to advise the Divisions concerned on general administrative policy or a special problem."
    }
  ]
}

