{
  "part": "G",
  "title": "RELATIONS WITH PROVINCES",
  "rules": [
    {
      "number": "48",
      "title": "Directions to the Governors",
      "content": "No Division shall issue a directive to the Governor of the Province under clause (1) of Article 145 without the specific approval of the Prime Minister."
    },
    {
      "number": "49",
      "title": "Obligations of Provinces and Federation",
      "content": "(1) Omitted vide S.R.O 368(I)/2010 (F.No.4-6/2010-Min-I) dated 1st June 2010.\n(2) Omitted vide S.R.O 368(I)/2010 (F.No.4-6/2010-Min-I) dated 1st June 2010.\n(3) The implementation of an international agreement in the Provincial field shall normally be the responsibility of the Provincial Government unless in any case specific orders of the Prime Minister are obtained by the Division concerned in accordance with rule 15(1)(c).\n(4) The Foreign Affairs Division shall issue necessary instructions to the Provincial Governments in the matter of conducting correspondence with the Government of a foreign country or a Pakistan Diplomatic Mission abroad or a Foreign Mission in Pakistan or an International Organisation."
    },
    {
      "number": "50",
      "title": "Conferment of powers and imposition of duties upon a Province",
      "content": "The Division concerned shall obtain the specific orders of the Prime Minister, if it is proposed to enact a law conferring powers and imposing duties upon a Province or officers or authorities thereof under clause (2) of Article 146."
    },
    {
      "number": "50A",
      "title": "Secretariat of Council of Common Interests",
      "content": "(1) There shall be a Secretariat of the Council of Common Interests (SCCI), having status of a Division which shall be headed by the Secretary to the Council of Common Interests.\n\n(2) The Secretary of the Council shall report directly to the Prime Minister, in the latter’s capacity as Chairman, CCI and shall also function as principal accounting officer of the Secretariat.\n\n(3) The procedure for conduct of business of the Council of Common Interests shall be governed in terms of the Rules of Procedure of the Council of Common Interests, 2010."
    }
  ]
}
