[
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "20",
    "Title": "Procedure regarding Cabinet Meetings",
    "Content": "(1) Meeting of the Cabinet to discuss ordinary business shall normally be held once a week, on a day and time to be specified by the Prime Minister.\n\nProvided that the Prime Minister may call for a special meeting of the Cabinet at any time and on any day to discuss urgent business.\n\n(1A) Meetings of the Cabinet will be attended by the Federal Ministers.\n\nProvided that the Prime Minister may require the Ministers of State, Advisers and Special Assistants to the Prime Minister and other dignitaries to attend any or all meetings of the Cabinet by special invitation.\n\n(2) Ministers shall so arrange their tours that they are able to attend the weekly Cabinet meetings, unless they have obtained the Prime Minister's permission to absent themselves, in which case their Secretary should invariably be in attendance at the Cabinet meeting if any item relating to his Division is on the agenda of the Cabinet meeting.\n\n(3) The Prime Minister may authorise the holding of Cabinet meetings during his absence.\n\n(4) The Prime Minister shall preside at all Cabinet meetings. In the absence of the Prime Minister, a Minister nominated by the Prime Minister shall preside. The decisions taken in the Prime Minister's absence shall be subject to the approval of the Prime Minister, unless the Cabinet feels that a particular case is so urgent that immediate action may be taken in anticipation of the Prime Minister's approval.\n\n(5) The Cabinet Secretary shall ordinarily issue to the Ministers, three days in advance of a meeting, a circular showing the cases proposed to be placed on the agenda, together with the summaries relating to such cases. In the case of special meetings, the agenda may be issued less than three days in advance. A copy of the agenda, without summaries shall also be supplied to the Secretaries of Divisions.\n\n(6) No case shall be discussed nor any issue raised unless the summary relating to it has first been circulated:\n\nProvided that the Prime Minister may, in his discretion or at the representation of a Minister, dispense with this requirement if he is satisfied that the circumstances were such that a working paper could not be supplied and the matter could brook no delay.\n\n(7) The Secretary shall be in attendance at the cabinet meeting for the purpose of the case relating to his Division even when his Minister attends that meeting.\n\n(8) Other officers of the Divisions shall not ordinarily be required to be in attendance at the Cabinet meetings except—\n\n(a) when information on points within their technical or specialised knowledge is required; or\n\n(b) when the Minister or the Secretary is unable to attend. In such cases any officer may be invited to the meeting by the Cabinet Secretary. Such officers may be asked to join the meeting only for the relevant case and, after giving the information required, shall withdraw from the meeting before discussion is taken up by the Cabinet.\n\n(9) If the Secretary of the Division concerned considers that the discussion on a case should await the return of the Minister, he may request the Cabinet Secretary for its postponement until the return of the Minister. Similarly, the Secretary may request for the withdrawal of a case belonging to his Division from the agenda of the Cabinet meeting.\n\n(10) When a case is taken up by a meeting of the Cabinet, the Prime Minister may request the Minister or the Secretary or any other officer of the Ministry concerned who may be in attendance in accordance with sub-rule (8), to explain the point or points on which a decision is required.\n\n(11) The Cabinet Secretary and or any other officer of the Cabinet Division authorized by him shall attend all meetings and prepare—\n\n(a) a brief record of the discussion which, in the absence of special directions by the Cabinet to the contrary, shall be of an impersonal nature;\n\n(b) a record of the decisions without any statement of the reasons therefore.\n\n(12) The Cabinet Secretary shall circulate to the Ministers, and if so desired by the Prime Minister, to the Advisers and Special Assistants to the Prime Minister a copy of the above record for perusal and return within twenty four hours of issue.\n\n(13) A copy of decision of the Cabinet, and wherever considered necessary of the points made during the discussion shall be supplied by the Cabinet Secretary to the Secretary of the Division concerned for action under rule 24.\n\n(14) If a Minister considers that there has been a mistake or omission in recording the minutes, he shall point it out to the Cabinet Secretary within 24 hours of the issue of the minutes. The Cabinet Secretary shall obtain the orders of the Prime Minister and, if necessary, issue a corrigendum, correct the official record in the Cabinet Division and advise the Secretary of the Division concerned.\n\n(15) Where a Minister was unable to attend a Cabinet meeting, and the Secretary attended the meeting, the record of the items concerning the Division shall be sent to the Secretary.",
    "Page Number": "14"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "20A",
    "Title": "Omitted",
    "Status": "Omitted via S.R.O 226(I)/2010 (F.No.4-4/2007-Min-I), dated 02.4.2010",
    "Page Number": "15"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "21",
    "Title": "Procedure regarding Inter-Provincial Conference",
    "Status": "Omitted via S.R.O No. 724(I)/2011 (F.No.4-9/2011-Min-I), dated 28.07.2011",
    "Page Number": "16"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "22",
    "Title": "Procedure regarding National Economic Council",
    "Content": "(1) Meetings of the National Economic Council shall be convened by the Cabinet Division under the directions of the Prime Minister who shall preside at the meetings.\n\n(2) The Federal and Provincial Ministers and officials of the Divisions concerned and of the Provincial Governments may be associated with the deliberations of the National Economic Council as and when considered necessary.\n\n(3) The provisions of rules 17, 18 and 20 shall apply mutatis mutandis to the manner of submission of cases to, and the procedure for the meetings of the National Economic Council except that the summary shall reach the Cabinet Division at least fifteen clear days in advance of the commencement of the meeting.\n\n(4) Other instructions regarding submission of cases to the National Economic Council shall be issued by the Cabinet Secretary.\n\n(5) There shall be an Executive Committee of the National Economic Council (ECNEC) to be appointed by the Prime Minister. The terms of reference of ECNEC shall be notified by the Cabinet Division with the approval of the Prime Minister.",
    "Amendments": [
      "Clause (5) added vide SRO 623(I)/2021 dated 27-05-2021"
    ],
    "Page Number": "16"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "23",
    "Title": "Procedure regarding Committees of Cabinet and National Economic Council.",
    "Content": "(1) Meetings of a Committee of the Cabinet or of the National Economic Council shall be convened by the Cabinet Division under the directions of the Chairman of the Committee concerned, who shall preside at the meeting of the Committee.\n\n(2) The members of the Committee shall attend the meetings:\n\nProvided that a Federal Minister or a Provincial Minister, where he is a member, if unable to attend a meeting, may authorize the Secretary of the Division or Department concerned to represent him.\n\n(3) Officials of the Divisions concerned and of the Provincial Governments may be associated with the deliberations of the Committee as and when considered necessary.\n\n(4) The provisions of rules 18, 19 and 20 shall apply mutatis mutandis to the manner of submission of cases to, and the procedure for the meeting of the Committee.\n\n(5) Other instructions regarding submission of cases to the Committee shall be issued by the Cabinet Secretary.",
    "Amendments": [
      "Substituted vide SRO 1171(1)/2018 dated 1st October, 2018",
      "Clause (5) added vide SRO 623(I)/2021 dated 27-05-2021"
    ],
    "Page Number": "16,21"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "24",
    "Title": "Action on decisions of the Cabinet, National Economic Council or their Committees, etc.",
    "Content": "(1) When a case has been decided by the Cabinet or the National Economic Council or their Committees, the Minister-in-Charge shall take prompt action to give effect to the decision.\n\n(2) When the decision is received by the Secretary of the Division concerned, he shall:\n(a) acknowledge the receipt of the decision in the form provided;\n(b) transmit the decision to his Division for action;\n(c) keep a register with himself of the decisions received, for the purpose of ensuring that prompt and complete action is taken on those decisions; and\n(d) coordinate action with any other Division concerned with the decision.\n\n(3) The Secretary of the Division concerned shall, on receipt of the Cabinet decision, communicate it to the Division but shall not forward the original documents. The decision shall be formally conveyed as decision of the Federal Government and details to the Ministers present at the meeting of the Cabinet, Committee of Cabinet etc., shall not be disclosed.\n\nNote: The record of the discussion before a decision was taken shall not be passed down unless it contains points which require further consideration or action in the Division concerned.\n\n(4) To ensure implementation of the Cabinet decisions, the Secretary of each Division shall keep a record of all the decisions conveyed to him and shall watch progress of action until it is completed. It shall be his responsibility as Secretary of the Division sponsoring the summary to consult or inform any other Divisions concerned, in order to ensure full implementation of the decision.\n\n(5) The Cabinet Secretary shall watch the implementation of Cabinet decisions, and the Secretary in the Division concerned shall supply to the Cabinet Secretary such documents as the latter may, by general or special request, require to enable him to complete his record of the case.\n\n(6) The Cabinet Secretary shall maintain the record of each case which shall consist of:\n(a) a copy of all papers issued under rules 19(1), 20(5), 22(3) or 23(4);\n(b) a copy of the records prepared under rules 19(2), 20(11) or 23(4);\n(c) all documents received under sub-rule (5).\n\n(7) The Secretaries shall retain in their personal custody the record of Cabinet decisions and discussions conveyed to them under rule 20(13), and shall make them over to their successors at the time of handing over charge.\n\n(8) All papers submitted to Cabinet are secret until the Cabinet discussion has taken place. Thereafter each Secretary shall decide whether the case should continue to be classified as secret and inform the Cabinet Division of his decision.\n\n(9) The Ministers shall return to the Cabinet Secretary:\n(a) the papers issued to them for decision by circulation, immediately after recording their opinion;\n(b) the papers issued to them for decision by discussion in a meeting of the Cabinet or Committee of the Cabinet, etc., under rule 20(5), 22(3) or 23(4), immediately after the discussion has taken place;\n(c) copies of the record of discussion and decision circulated by the Cabinet Secretary under rule 19(1), 20(12), 22(3) or 23(4), immediately after they have perused them; and\n(d) reports of action taken on Cabinet decisions, or other papers circulated for information, immediately after perusal.",
    "Page Number": "22"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "25",
    "Title": "Periodical reports of activities of Divisions",
    "Content": "(1) [Omitted vide SRO 135(I)/98, dated 3rd March, 1998.]\n\n(2) At the beginning of each financial year, each Division shall, for the information of the Cabinet and for general public, prepare and upload on its website as a permanent record a Year Book which shall contain--\n(a) the details of its activities, achievements and progress during the preceding financial year giving only the unclassified information which can be used for reference purposes;\n(b) the programme of activities and targets set out for itself during the preceding financial year and the extent to which they have been realized; and\n(c) the relevant statistics properly tabulated.\n\nNote: The Secretary of the Division shall ensure that only unclassified material is supplied for the Year Book so that the information contained therein may be available for the use of academics, scholars and other interested.\n\n(3) Secretary of each Division shall inform the Cabinet Secretary, within ninety days at the end of the financial year under report, about availability of the Year Book, who shall disseminate this information to all members of the Cabinet and all Divisions.",
    "Amendments": [
      "Clause (1) omitted vide SRO 135(I)/98, dated 3rd March, 1998",
      "Clauses (2) and (3) substituted vide SRO 40(I)/2019, dated 11th January, 2019"
    ]
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "26",
    "Title": "Annual Report",
    "Content": "(1) There shall be prepared by the Cabinet Division an annual report on the observance and implementation of the Principles of Policy in relation to the affairs of the Federation in terms of clause (3) of Article 29.\n\n(2) The Law and Justice Division shall cause the report to be laid before each House of the Majlis-e-Shoora (Parliament).\n\n(3) The provisions of rule 25(2) and (3) shall apply for the preparation and submission of the report to Cabinet as they apply to a Year Book.",
    "Amendments": [
      "Substituted via SRO 40(I)/2019, dated 11th January, 2019"
    ]
  }
]

