{
  "part": "II",
  "title": "DISTRIBUTION OF BUSINESS AMONG DIVISIONS (Rule 3(3))",
  "rules": [
    {
      "number": "1",
      "title": "Omitted",
      "note": "Omitted vide SRO 83(I)/2025 dated 4th February, 2025"
    },
    {
      "number": "2",
      "title": "Cabinet Division",
      "functions": [
        "All secretarial work for the Cabinet, National Economic Council and their Committees, Secretaries' Committee.",
        "Follow up and implementation of decisions of all the bodies mentioned at (1) above.",
        "National Economic Council: Its constitution and appointment of members.",
        "Secretaries Committee.",
        "Central Pool of Cars.",
        "All matters relating to President, Prime Minister, Federal Ministers, Ministers of State, Persons of Minister's status without Cabinet rank, Special Assistants to the Prime Minister.",
        "Appointments, resignations, salaries, allowances and privileges of Provincial Governors.",
        "Strength, terms and conditions of service of the personal staff of the Ministers, Ministers of State, Special Assistants to the Prime Minister, dignitaries who enjoy the rank and status of a Minister or Minister of State.",
        "Rules of Business: Setting up of a Division, allocation of business to a Division and constitution of a Division or group of Divisions as a Ministry.",
        "Implementation of the directives of the President/Prime Minister.",
        "Preparation of Annual Report in relation to Federation on observance of Principles of Policy.",
        "Budget for the Cabinet: Budget for the Supreme Judicial Council.",
        "Coordination of defence effort at the national level by forging effective liaison between the Armed Forces, Federal Ministries and the Provincial Governments at the national level; Secretariat functions of the various Post War Problems.",
        "Communications Security.",
        "Instructions for delegations abroad and categorization of International conferences.",
        "Security and proper custody of official documents and Security Instructions for protection of classified matter in Civil Departments.",
        "Preservation of State Documents.",
        "Coordination: Control of fixed line office and residence telephones, mobile phones, faxes, internet/DSL connections, ISD, toll-free numbers, green telephones etc., staff cars; Rules for the use of staff cars; common services such as teleprinter service, mail delivery service, etc.",
        "Civil Awards: Gallantry Awards.",
        "Tosha Khana.",
        "Repatriation of civilians and civil internees from India, Bangla Desh and those stranded in Nepal and other foreign countries, and all other concerned matters.",
        "Resettlement and rehabilitation of civilians and civil Government servants uprooted from East Pakistan including policy for grant of relief and compensation for losses suffered by them.",
        "All matters arising out of options exercised by and expatriation of Bengalies from Pakistan.",
        "Grant of subsistence allowance to Government servants under the rule making control of the Government of East Pakistan and its corporations, and their families stranded in West Pakistan.",
        "Management of movable and immovable properties left by the Bengalis in Pakistan.",
        "Administration of the 'Special Fund' for POWs and civilian internees held in India and War displaced persons.",
        "Defence of Pakistan Ordinance and Rules.",
        "Stationery and Printing for Federal Government official Publications, Printing Corporation of Pakistan.",
        "National Archives including Muslim Freedom Archives.",
        "People Works Programme (Rural Development Programme).",
        "Pride of Performance Award in the field of arts.",
        "Pride of Performance Award in academic fields.",
        "Pakistan Tourism Development Corporation and its subsidiaries.",
        "Treaty Implementation Cell.",
        "Islamabad Club.",
        "Pakistan Commissions of Inquiry Act, 2017.",
        "Naya Pakistan Housing and Development Authority.",
        "Administrative control of the NEPRA, PTA, FAB, OGRA and PPRA.",
        "Prime Minister’s Performance Delivery Unit (PMDU) including Pakistan Citizen Portal (PCP), operation and management by PM Office (Public)."
      ]
    },
    {
  "number": "6",
  "title": "Communications Division",
  "content": [
    "National policy, planning, research and international aspects of roads and road transport; logistic; freight and coordination of multi model transportation.",
    "Motorway, National highways and strategic roads; National Highway Council and Authority; Administration of the Central Road Fund and Fund for Roads of National Importance.",
    "Enemy property.",
    "National highways and Motorways police.",
    "National Roads Safety Council, National Road Safety Steering Committee and National Road Safety Secretariat.",
    "Postal Services and Postal Life Insurance Company Limited.",
    "(i) Services provided on behalf of the Federal Government and Provincial Government; (ii) Agency functions on behalf of agency alliances and partnerships with corporate entities under regulatory regime of the Government such as the State Bank of Pakistan and the Securities and Exchange Commission of Pakistan, etc.",
    "Establish, regulate specialized entities in logistic and freight."
  ]
  },
  {
  "number": "7",
  "title": "Defence Division",
  "content": [
    "Defence of the Federation or any part thereof in peace or war including: (i) Army, naval and air forces of the Federation and any other armed forces raised or maintained by the Federation; and armed forces which are not the forces of the Federation but are attached to or operating with any of the armed forces of the Federation; (ii) Army, naval and air force works.",
    "Civilian employees paid from the Defence estimates.",
    "Defence matters pertaining to treaties and agreements with other Governments except those relating to purchase of stores; and matters regarding military assistance to foreign countries.",
    "Stores and stationery for the Defence Services, other than those dealt with by the Defence Production Division.",
    "(i) Administrative control of Northern Light Infantry; (ii) Administration of National Guards Act, 1973.",
    "International Red Cross and Geneva Conventions in so far as they effect belligerents.",
    "Military awards and decorations.",
    "Welfare of ex-servicemen.",
    "Cantonment areas including: (i) the delimitation of such areas; (ii) Local Self-Government in such areas, the constitution of local authorities for such areas and the functions and powers of such authorities; and (iii) the regulation of housing accommodation (including control of rent) in such areas.",
    "Acquisition or requisitioning of property for Defence Services; imposition of restrictions upon the use of lands in the vicinity of such property and of works of Defence.",
    "Pardons, reprieves and respites, etc., of all personnel belonging to the Armed Forces.",
    "Survey of Pakistan.",
    "Administrative and budgetary control of Federal Government Educational Institutions (Cantonments/Garrisons) Directorate and its Institutions.",
    "Administration of Military Lands and Cantonments Group.",
    {
      "title": "Omitted Clauses",
      "content": "Clauses 15 to 22 omitted vide S.R.O. 622(I)/2013 dated 28.06.2013.",
      "omitted": true
    },
    "National Maritime policy.",
    "Matters relating to security of resources of the Maritime Zones of Pakistan including protection of human life and property.",
    "Pakistan Maritime Security Agency.",
    "National coordination of maritime activities.",
    "National Maritime Affairs Coordination Committee.",
    "Marine surveys and elimination of dangers to navigation.",
    "Promotion of maritime disciplines.",
    "International aspects: (i) Matters arising out of the implementation of law of the Sea pertaining to Maritime Affairs. (ii) International negotiations, agreements and treaties (excluding those handled by other Divisions). (iii) Liaison with International Sea Bed Authorities and other International Agencies in the Maritime field.",
    {
      "title": "Omitted Clause",
      "content": "Clause 29 omitted vide SRO 850(I)/2014 dated 25.09.2014.",
      "omitted": true
    },
    "Fauji Foundation.",
    "Administrative functions in respect of: (a) the National University of Pakistan Act, 2023 (XV of 2023); (b) the Pakistan Airports Authority Act, 2023 (XLV of 2023); (c) the Pakistan Civil Aviation Act, 2023 (XLIX of 2023); (d) the Pakistan Air Safety Investigation Act, 2023 (L of 2023); and (e) the National Logistics Corporation Act, 2023 (LII of 2023).",
    "Aircraft and air navigation.",
    "Development of civil aviation in Pakistan.",
    "Provision of aerodromes.",
    "Airports Development Agency.",
    "Regulation, organization and safety of air traffic and of aerodromes and administration of Airports Security Force.",
    "Pakistan International Airlines Corporation.",
    "Air Service agreements with other countries; liaison with International Civil Aviation Organization and other international agencies concerned with aviation.",
    "Federal Meteorological Organizations and Meteorological observatories; World Meteorological Organizations."
  ]
 },
 {
  "number": "8",
  "title": "Defence Production Division",
  "content": [
    "Laying down policies or guidelines on all matters relating to defence production.",
    "Procurement of arms, firearms, weapons, ammunition, equipment, stores and explosives for the defence forces.",
    "Declaration of industries necessary for the purpose of defence or for the prosecution of war.",
    "Research and development of defence equipment and stores.",
    "Co-ordination of defence science research with civil scientific research organizations.",
    "Indigenous production and manufacture of defence equipment and stores.",
    "Negotiations of agreements or MOUs for foreign assistance or collaboration and loans for purchase of military stores and technical know-how or transfer of technology.",
    "Export of defence products.",
    "Marketing and promotion of activities relating to export of defence products.",
    "Co-ordinate production activities of all defence production organizations or establishments."
  ]
 },
 {
  "number": "9",
  "title": "Economic Affairs Division",
  "content": [
    "Assessment of requirements; programming and negotiations for external economic assistance from foreign Governments and organizations.",
    "Matters relating to IBRD, IDA, IFC, ADB and IFAD.",
    "Economic matters pertaining to the Economic and Social Council of the United Nations, Governing Council of UNDP, ESCAP, Colombo Plan and OECD (DAC).",
    "Negotiations and coordination activities pertaining to economic cooperation with other countries (excluding RCD and IPECC).",
    "Assessment of requirements, programming and negotiation for securing technical assistance to Pakistan from foreign Governments and organizations, including nominations for EDI Courses.",
    "Omitted vide S.R.O.622(I)/2013, dated 28.06.2013.",
    "External debt management including authorization of remittances for all external debt service, compilation, accounting and analysis of foreign economic assistance.",
    "Review and appraisal of international and regional economic trends and their impact on the national economy. Proposals concerning changes in International Economic Order.",
    "Matters relating to transfer of technology under UNDP assistance.",
    "Matters relating to International Islamic Development Bank.",
    "Omissions from 11 to 25: Marked with respective SROs (if you want, these can be added as omitted entries with `omitted: true`)."
  ]
 },
 {
  "number": "10",
  "title": "Establishment Division",
  "content": [
    "Regulation of matters of general applicability to civil posts in the Federation, including recruitment, promotion, conduct, and terms of service.",
    "Formation of Occupational Groups.",
    "Policy and administration of All-Pakistan Unified Grades and Office Management Group.",
    "Policy regarding recruitment to various grades.",
    "Grant of ex-officio status to non-Secretariat officers.",
    "Training in Public Administration; oversight of relevant training institutes including NIPA, PAS, CSA, etc.",
    "Federal Government functions relating to the Federal Public Service Commission.",
    "General service matters including casual leave, office hours, and policy questions.",
    "Matters relating to Central and Special Selection Boards.",
    "Career planning and maintenance of Annual Confidential Reports.",
    "Staff Welfare, Federal Employees Benevolent Fund and Group Insurance.",
    "Administration of the Civil Servants Act, 1973 and related rules.",
    "Administrative Reforms.",
    "Management consulting for the Federal Government using techniques like PERT, CPM, O&M.",
    "Review and reorganization of Divisions and departments for efficiency.",
    "Simplification of systems and procedures to minimize corruption and public inconvenience.",
    "Training and promotion of O&M techniques, systems analysis, operations research, etc.",
    "Idea award scheme.",
    "Pakistan Public Administration Research Centre.",
    "Reorganization of a Division or attached department; determining the status of Government offices.",
    "Omissions: 24, 25 (SRO788/2011), and 26 (SRO964/2014) — mark as omitted if needed."
  ]
 },
 {
      "number": "11",
      "title": "Federal Education and Professional Training Division",
      "functions": [
        "National Vocational and Technical Education Commission (NAVTEC).",
        "Omitted vide SRO 1434 (I)/2024 dated 11-09-2024.",
        "Federal Board of Intermediate and Secondary Education (FBISE), Islamabad.",
        "Omitted vide SRO 1434 (I)/2024 dated 11-09-2024.",
        "Omitted vide SRO 964(I)/2014 dated 29.10.2014.",
        "Omitted vide SRO 389 (I)/2013 dated 15.05.2013.",
        "National Talent Pool, Islamabad.",
        "Youth Centres.",
        "All matters relating to National Commission for Human Development (NCHD) and National Education Foundation (NEF).",
        "Pakistan National Commission for UNESCO (PNCU).",
        "Higher Education Commission.",
        "External examination and equivalence of degrees and diplomas.",
        "Commission for standards for higher education.",
        "Pakistan technical assistance programme in the field of education, professional and technical training.",
        "National Institute of Science and Technical Education, Islamabad.",
        "National College of Arts, Lahore and Rawalpindi.",
        "Pakistan Chairs Abroad.",
        "Selection of Scholars against Pakistan Chairs Abroad by the Special Selection Board.",
        "Boy Scouts and Girl Guides; Youth Activities and Movement.",
        "International exchange of students and teachers, foreign studies and training and international assistance in the field of education.",
        "Omitted vide SRO 939(1)/2019 dated 19-08-2019.",
        "Federal College of Education, Islamabad.",
        "Federal Directorate of Education and education in the Capital.",
        "Federal Government Polytechnic Institute of Women, Islamabad.",
        "Omitted vide SRO 1373(1)/2021 dated 01-12-2021.",
        "Omitted vide SRO 939(1)/2019 dated 19-08-2019.",
        "Private Educational Institutions Regulatory Authority.",
        "Omitted vide SRO 939(1)/2019 dated 19-08-2019.",
        "Relationship with UNESCO and participation in its activities, liaison with other international agencies and organizations in educational programs.",
        "National Book Foundation.",
        "Awards of— (i) Izaz-e-Kamal; (ii) Izaz-e-Fazeelat; and (iii) Izaz-e-Sabqat.",
        "Inter Board Committee of Chairmen.",
        "Matters related to Deeni Madaris and mainstreaming of religious education.",
        "Administrative functions in respect of the following laws: (a) The International Institute of Science, Arts and Technology Act, 2022 (XIV of 2022); (b) The National Rahmatul-Lil-Aalameen Wa Khatamun Nabiyyin Authority Act, 2022 (XV of 2022); (c) The Dyslexia Special Measures Act, 2022 (XXIV of 2022); (d) The Smart Institute of Sciences & Technology Act, 2022 (XXXIV of 2022); (e) The Pakistan Global Institute Act, 2023 (XI of 2023); (f) The Inter-Boards Coordination Commission Act, 2023 (XIII of 2023); (g) The Pakistan Institute of Research and Registration of Quality Assurance Act, 2023 (XXII of 2023); (h) The Pir Roshaan Institute of Progressive Sciences and Technologies, Miranshah Act, 2023 (XXV of 2023); (i) The Kalam Bibi International Women Institute Bannu Act, 2023 (XXVII of 2023); (j) The Trained Paramedical Staff Facility Act, 2023 (XXX of 2023); (k) The Maternity and Paternity Leave Act, 2023 (XXXI of 2023).",
        "Virtual University."
      ]
    },
    {
      "number": "12",
      "title": "Finance Division",
      "functions": [
        "Finances of the Federal Government and financial matters affecting the country as a whole.",
        "The Annual Budget Statement and the Supplementary and Excess Budget Statements to be laid before the National Assembly; the schedules of authorized expenditure.",
        "Accounts and audit.",
        "Allocation of share of each Provincial Government in the proceeds of divisible Federal Taxes; National Finance Commission.",
        "Public debt of the Federation both internal and external; borrowing money on the security of the Federal Consolidated Fund.",
        "Loans and advances by the Federal Government.",
        "Sanctions of internal and external expenditure requiring concurrence of the Finance Division.",
        "Advice on economic and financial policies; promotion of economic research.",
        "Proper utilization of the country's foreign exchange resources.",
        "Currency, coinage and legal tender, Pakistan Security Printing Corporation and Pakistan Mint.",
        "Banking, investment, financial and other corporations: (i) Central Banking; State Bank of Pakistan; (ii) Other banking (not including co-operative banking) and investment and financial corporations with objects and business not confined to one Province; (iii) Incorporation, regulation and winding up of corporations including banking insurance and financial corporations not confined to or controlled by or carrying on business in one Province; (iv) Business related to the Federal Government Properties Management Authority (FGPMA).",
        "Company Law: Accountancy.",
        "Investment policies: Capital issues (Continuance of Control) Act, 1947; statistics and research work pertaining to investment and capital.",
        "Stock exchanges and future markets with objects and business not confined to one Province; Securities Regulations.",
        "Financial settlement between Pakistan and India and division of assets and liabilities of the pre-independence Government of India.",
        "Framing of rules on pay and allowances, retirement benefits, leave benefits and other financial terms and conditions of service.",
        "Cost Accountancy.",
        "International Monetary Fund.",
        "Omitted vide SRO 294(I)/2011 dated 08.04.2011.",
        "Monopoly Control and anti-Cartel Laws.",
        "Omitted vide Cabinet Division Notification No.4-14/98-Min.I, dated 01.12.1998.",
        "Omitted vide Cabinet Division Notification No.4-14/98-Min.I, dated 01.12.1998.",
        "Omitted vide Cabinet Division Notification No.4-14/98-Min.I, dated 01.12.1998.",
        "Omitted vide Cabinet Division Notification No.4-14/98-Min.I, dated 01.12.1998.",
        "Deregulation policies.",
        "Administration of Economic Reforms Order, 1978.",
        "Negotiations with international organizations and other countries and implementation of agreements thereof.",
        "Omitted vide SRO 487 (I)/2019 dated 23-04-2019.",
        "Omitted vide SRO 487 (I)/2019 dated 23-04-2019.",
        "Omitted vide SRO 939(1)/2019 dated 19-08-2019.",
        "Administrative functions in respect of the following laws: (a) All Finance Acts; (b) The Export-Import Bank of Pakistan Act, 2022 (XXII of 2022); (c) The Inter-Governmental Commercial Transactions Act, 2022 (XXX of 2022); (d) The Foreign Investment (Promotion and Protection) Act, 2022 (XXXV of 2022); (e) The State-Owned Enterprises (Governance and Operations) Act, 2023 (VII of 2023); (f) The Pakistan Sovereign Wealth Fund Act, 2023 (XLVIII of 2023)."
      ]
    },
    {
      "number": "13",
      "title": "Foreign Affairs Division",
      "functions": [
        "Relations and dealings with other countries.",
        "Matters (other than those handled by other Divisions) relating to: (a) international organizations and bodies and their decisions; (b) agreements and treaties with other countries.",
        "Diplomatic, consular, trade and other representation abroad (Selection of officers for appointment as Commercial Secretaries, Attaches etc. shall continue to be made on the recommendations of the Special Selection Board and posting and transfer of such officers will be done by the Ministry concerned).",
        "Declaration of war upon, and the making of peace with any country.",
        "Offences against the laws of nations.",
        "Foreign and extra-territorial jurisdiction.",
        "Negotiations for settlement of Kashmir dispute and implementation of agreements reached.",
        "Administration of Foreign Service of Pakistan; Pakistan Missions abroad; Security and operation of cypher communications.",
        "Visits of the Heads of States and foreign dignitaries to Pakistan and the Head of the Government of Pakistan to foreign countries.",
        "Protocol and matters relating to foreign representatives in Pakistan; Federal Government Guest Houses.",
        "Policy regarding extradition to and from other countries.",
        "Repatriation of Pakistan nationals from abroad (other than those handled by other Divisions).",
        "Foreign awards to Pakistanis.",
        "Pakistan Institute of International Affairs.",
        "Coordination of all work pertaining to Economic Cooperation Organization (ECO).",
        "Institute of Strategic Studies.",
        "Administration of Export Control on Goods, Technologies, Material and Equipment related to Nuclear and Biological Weapons and their Delivery System Act, 2004 (V of 2004).",
        "Welfare of Pakistani students abroad and foreign students in Pakistan."
      ]
    },
    {
  "number": "14",
  "title": "Housing and Works Division",
  "content": [
    "Acquisition of Federal Government buildings, except those under the Defence Division.",
    "Provision of Government owned office accommodation and residential accommodation, policy for acquisition, requisitioning and hiring of office and residential accommodation for officers and staff of the Federal Government.",
    "Fixation and recovery of rent of Government owned, hired and requisitioned buildings.",
    "Management of Federal lodges.",
    "Land and buildings belonging to the Federation wherever situated and revenues derived therefrom.",
    "Administration of the Federal Government Lands and Buildings (Recovery of Possession) Ordinance, 1965 (LIV of 1965).",
    "Matters relating to the Federal Government lands licenses to various cooperative housing societies in Karachi, except those under the Defence Division.",
    "Transfer of property, other than agricultural land, registration of deeds and documents.",
    {
      "title": "Omitted Clause",
      "content": "Clause 9 omitted vide SRO 1373(1)/2021 dated 01-12-2021.",
      "omitted": true
    },
    "National Housing Policy.",
    "Development of sites, construction, furnishing and maintenance of Federal Government buildings, except those under the Defence Division and Foreign Affairs Division. Exemption is also allowed to the Foreign Affairs Division for maintenance of Foreign Office buildings and allied buildings. A certain public work may be implemented by respective Division at its level after getting No Objection Certificate from the Housing and Works Division for the project with appropriate justification. The Housing and Works Division shall consider these requests on case to case basis.",
    "(i) Coordination of civil works budget; (ii) Execution of Federal Government works.",
    "Officers belonging to the Engineering Group.",
    "Matters relating to the National Construction (Domestic) Limited.",
    "Physical planning.",
    "Sindh Infrastructure Development Company Limited (SIDCL)."
  ]
},
{
  "number": "14A",
  "title": "Human Rights Division",
  "content": [
    "Review of human rights situation in the country including implementation of laws, policies and measures.",
    "Coordination of activities of Ministries, Divisions and Provincial Governments in respect of human rights, and facilitation functions relating to human rights.",
    "Initiatives for harmonization of legislation, regulations and practices with the international human rights covenants and agreements to which Pakistan is a party and monitoring their implementation.",
    "Obtaining information, documents and reports, on complaints and allegations of human rights violations, from Ministries, Divisions, Provincial Governments and other agencies.",
    "Referring and recommending investigations and inquiries in respect of any incident of violation of human rights, including rights of disadvantaged and child rights.",
    "Pursuing or defending issues, complaints, representations and matters for and against Pakistan relating to human rights before any official or non-Governmental organizations, body or forum in Pakistan and, in consultation with Foreign Affairs Division, before any international organization and foreign Government or non-Governmental organization.",
    "Representation of Pakistan in international bodies, organizations and conferences relating to human rights in consultation and conjunction with Foreign Affairs Division.",
    "Developing and conducting information programmes to foster public awareness about human rights including the rights of labour, women and children and laws and remedies available to them.",
    "Formulating programmes for teaching of human rights at educational institutions.",
    "Provision of facilities for professional and technical training at national and international level relating to human rights issues.",
    "Administrative control of the Tribunal for disadvantaged persons.",
    "Human rights NGOs.",
    "Representing Pakistan at international and bilateral level, involving all gender related matters.",
    "Administration of the National Commission on the Status of Women Act, 2012 (VIII of 2012).",
    "Administration of the National Commission for Human Rights Act, 2012.",
    "Administration of the National Commission for Child Welfare and Development Resolution, 1981.",
    "Social Welfare, Special Education, welfare, development and rehabilitation of children and disabled in the Federal area.",
    "Training and education of disabled in Islamabad.",
    "Dealing and agreements with other countries and international organizations in the field of social welfare.",
    "Awards of: (i) President’s Medal Mohtarma Fatima Jinnah; and (ii) President’s Medal Mohtarma Shaheed Benazir Bhutto."
  ]
 },
 {
  "number": "15",
  "title": "Industries and Production Division",
  "content": [
    "National industrial planning and coordination.",
    "Industrial policy.",
    "Employment of foreign personnel in commercial and industrial enterprises.",
    "Federal agencies and institutions for: (i) promoting industrial productivity; (ii) promoting special studies in the industrial fields; and (iii) testing industrial products.",
    "Keeping a watch, from the national angle, over general price trends and supply position of essential commodities; price and distribution control over items to be distributed by statutory orders between the Provinces.",
    {
      "title": "Omitted Clause",
      "content": "Clause 6 omitted vide SRO 973(1)/2017 dated 25-09-2017 (F.N.4-2/2016-Min-I).",
      "omitted": true
    },
    "Import and distribution of white oil.",
    "Explosives (excluding the administration of Explosive Substances Act, 1908) and safety measures under the Petroleum Act, 1934 and Rules made thereunder.",
    "Prescription and review of criteria for assessment of spare parts and raw materials for industries.",
    "Administration on law on Boilers.",
    "Administrative, financial, operational, personnel and commercial matters of Pakistan Garments Corporation.",
    "Ghee Corporation of Pakistan Limited, and Pakistan Edible Oils Corporation Limited.",
    "National Fertilizer Corporation, Lahore.",
    "Development of Industries (Federal Control) (Repeal) Ordinance, 1979.",
    "Economic Reforms (Protection of Industries) Regulation, 1972 (Regulation No. 125 of 1972).",
    "All matters relating to state industrial enterprises, especially, in basic and heavy industries, namely: (a) State Engineering Corporation, Karachi; (b) State Cement Corporation, Lahore; (c) Pakistan Automobile Corporation, Karachi; (d) State Petroleum Refining and Petrochemical Corporation, Karachi; (e) Federal Chemical and Ceramics Corporation, Karachi; (f) Pakistan Steel Mills Corporation, Karachi; (g) Pakistan Industrial Development Corporation (PIDC).",
    "Any other industrial enterprises assigned to the Division.",
    "Administrative control of Sugar Advisory Board.",
    "Administrative functions in respect of the Pakistan General Cosmetics Act, 2023 (XLIII of 2023).",
    "Small and Medium Enterprises Development Authority (SMEDA)."
  ]
 },
 {
  "number": "16",
  "title": "Information Division",
  "content": [
    "Policy relating to internal publicity, Press provisions under Post Office Act, 1898 and Telegraph Act, 1885.",
    "Broadcasting and television policy.",
    "Film production on behalf of Government agencies.",
    "Press relations, journalist delegations.",
    "Support for newspaper industry.",
    "Advertisement policy and audit of newspaper circulation.",
    "Newsprint Control Ordinance, 1971.",
    "National Anthem.",
    "Media coordination on Government policy.",
    "Administration of the Information Group.",
    "External Publicity.",
    "Pakistan National Centres.",
    "Administration of media-related laws: Pakistan Broadcasting Corporation Act, APP Ordinance, PEMRA.",
    "Matters relating to PTV, Shalimar Recording Company.",
    "Radio and TV personnel training.",
    "Press Officers Selection Board.",
    "Establishment of tourist centres abroad.",
    "Administration of the Newspapers Employees Act, 1973.",
    "Promotion of Government policies through digital media.",
    "Press Council of Pakistan.",
    "National Press Trust.",
    "Protection of Journalists and Media Professionals Act, 2021.",
    "Access to the Media (Deaf) Persons Act, 2022."
  ]
 },
 {
  "number": "17",
  "title": "Information Technology and Telecommunication Division",
  "content": [
    "Formulation of national IT and telecom development policy.",
    "Coordination with provinces, private sector and foreign bodies.",
    "Human resource development in IT and telecom.",
    "Promotion of IT applications.",
    "Software standardization guidelines.",
    "Telecom legislation and policy (excluding broadcasting).",
    "Matters related to NITB, PSEB, and Electronic Government Directorate.",
    "Matters relating to NTC, TF, SCO, and Certification Council.",
    "Safeguarding government equity in PTCL, USF, ICT R&D, etc.",
    "Administrative functions under the National Information Technology Board Act, 2022."
  ]
 },
 {
  "number": "17A",
  "title": "Intelligence Bureau Division",
  "content": [
    "Matters relating and ancillary to Federal Intelligence."
  ]
 },
 {
  "number": "18",
  "title": "Interior and Narcotics Control Division",
  "content": [
    "Internal and public security, international cooperation.",
    "Preventive detention on grounds of security or order.",
    "Citizenship and naturalization.",
    "Immigration policy and documentation (passports, visas, etc.).",
    "Censorship and publication bans.",
    "National Database and Registration (NADRA).",
    "Federal Secretariat and department security.",
    "Clemency powers (non-military).",
    "Police Commission and awards.",
    "Civil Defence training and coordination.",
    "State ceremonies and mourning.",
    "Police policy coordination.",
    "Anti-smuggling efforts.",
    "Federal Police Forces matters.",
    "Civil Armed Forces (Rangers, FC, Coast Guards).",
    "Firearms law in Federal areas.",
    "Border incident coordination.",
    "Govt servant visit permissions to India.",
    "Political asylum and genocide matters.",
    "Criminal surrender and extradition.",
    "Penal reform policy and jail training.",
    "Non-Muslim shrines and religious pilgrimages.",
    "National Police Academy.",
    "FIA administrative control.",
    "Investigation under FIA Act schedule.",
    "INTERPOL liaison.",
    "Anti-Corruption laws (excluding NAB).",
    "ICT Administration and Advocate General.",
    "CDA and Metropolitan Corporation Islamabad.",
    "Zakat and Ushr in Islamabad.",
    "National Counter Terrorism Authority (NACTA).",
    "Administrative functions under several ICT and narcotics-related laws including:",
    "ICT Local Government Act, 2015; Domestic Workers Act, 2022; Torture Act, 2022; Prohibition of Interest Act, 2023; Day Care Centres Act, 2023; Federal Prosecution Service Act, 2023; Prevention of Electronic Crimes Act, 2016.",
    "Narcotics production, trafficking, laws, and rehabilitation.",
    "International narcotics treaties and aid coordination.",
    "Monitoring and control policies of narcotics.",
    "Administration of Pakistan Narcotics Control Board."
  ]
 },
 {
  "number": "19",
  "title": "Inter-Provincial Coordination Division",
  "content": [
    "General coordination between the Federal Government and the Provinces in the economic, cultural and administrative fields.",
    "Promoting uniformity of approach in policy formulation and implementation among the Provinces and the Federal Government in all fields of common concern.",
    "Discussions of policy issues emanating from the Provinces which have administrative or economic implications for the country as a whole.",
    "Any other matter referred to the Division by a Province or any Ministry or Division of the Federal Government.",
    "Malam Jabba Resort Ltd.",
    "Pakistan Veterinary Medical Council, Islamabad.",
    "Medical, nursing, dental, pharmaceutical, para-medical and allied subjects education abroad.",
    "Educational facilities for backward areas and for foreign nationals.",
    "Legislation covering all aspects of sports affairs and matters ancillary thereto.",
    "Administrative control of Board established for the promotion and development of sports under the Sports (Development and Control) Ordinance, 1962 (XVI of 1962).",
    "Pakistan Sports Board (PSB).",
    "Dealing and agreements with other countries and international organizations in matters relating to Youth Exchange Programmes (External).",
    "National Internship Programme.",
    "National Volunteer Movement.",
    "Paralympics.",
    "Gun and Country Club.",
    "Federal Land Commission.",
    "International organizations and agreements relating to tourism.",
    "Administrative functions in respect of the Gun and Country Club Act, 2023 (LI of 2023)."
  ]
 },
 {
  "number": "20",
  "title": "Kashmir Affairs, Gilgit-Baltistan and States and Frontier Regions Division",
  "content": [
    "Policy, planning and development for Gilgit-Baltistan.",
    "Coordination with the Government of Gilgit-Baltistan and Gilgit-Baltistan Council.",
    "Coordination with the Azad Government of the State of Jammu and Kashmir and the AJ&K Council.",
    "Matters relating to the Settlement of Kashmir dispute, other than those falling within the purview of the Foreign Affairs Division.",
    "Administration of Jammu and Kashmir State Property in Pakistan.",
    "Processing of development schemes reflected in the PSDP of Ministry of Kashmir Affairs and Gilgit-Baltistan at the level of CDWP and ECNEC.",
    "Coordination between the Federal Government Organizations and the Government of Gilgit-Baltistan and the Gilgit-Baltistan Council.",
    "Coordinate with the Federal Public Service Commission on recruitment of various departments of Gilgit-Baltistan.",
    "Assisting Judicial Commissions on Boundary Disputes in ascertaining facts directly related with the national interests of Pakistan.",
    "Afghan Refugees.",
    "Affairs of the former and acceding States."
  ]
 },
 {
  "number": "21",
  "title": "Law and Justice Division",
  "content": [
    "Advice to Divisions on all legal and constitutional questions arising out of any case and on the interpretation of any law.",
    "Advice to Provincial Governments on legal and legislative matters.",
    "Drafting, scrutiny and examination of Bills, Ordinances, and all legal and other instruments.",
    "Dealings and agreements with other countries and international organizations in judicial and legal matters.",
    "Arrangements for publication and translation of Federal Laws and other statutory rules and orders; copyright in Government Law publications.",
    "Adaptation of existing laws to bring them in conformity with the Constitution.",
    "Legal proceedings and litigation concerning the Federal Government except litigation concerning Revenue Division.",
    "Administrative control of the Income Tax Appellate Tribunal and the Customs, Central Excise and Sales Tax Appellate Tribunal.",
    "Special Judges under the Criminal Law Amendment Act, 1958.",
    "Federal Government functions in regard to the Supreme Court, Supreme Judicial Council, High Courts, Federal Shariat Court, Federal Ombudsman, Tax Ombudsman, Insurance Ombudsman and Banking Mohtasib.",
    "Attorney General and other Law Officers of the Federation.",
    "Federal functions in respect of the Family Law Ordinance and the Conciliation Courts Ordinance.",
    "Consultation with the Attorney General for Pakistan.",
    "Courts and Tribunals, whether administrative or otherwise, for Federal subjects.",
    "Wills, intestacy and succession in respect of Federal areas (except agricultural land).",
    "Bankruptcy and insolvency, administrator general and official trustees in respect of Federal areas.",
    "Arbitration in respect of Federal areas and International arbitration.",
    "Trust and trustees in respect of Federal areas.",
    "Legal Practitioners and Bar Councils Act, 1973 (XXXV of 1973).",
    "The Law and Justice Commission Ordinance, 1979 (XIV of 1979) and Federal Government functions related to the Commission.",
    "The Federal Judicial Academy Act, 1997 (XXVIII of 1997) and Federal Government functions related to the Academy.",
    "Federal Government functions in regard to the National Accountability Bureau.",
    "National Accountability Ordinance, 1999 (XVIII of 1999).",
    "Ombudsperson under the Protection against Harassment of Women at the Workplace Act, 2010 (IV of 2010).",
    "Issuance of legal opinion for disbursement and drawdown.",
    "Council of Islamic Ideology.",
    "Legal Aid and Justice Authority.",
    "Administrative functions under the following laws:",
    "Legal Aid and Justice Authority Act, 2020 (XVI of 2020)",
    "The Lawyers Welfare and Protection Act, 2023 (XII of 2023)",
    "The Supreme Court (Practice and Procedure) Act, 2023 (XVII of 2023)",
    "The Supreme Court (Review of Judgements and Orders) Act, 2023 (XXIII of 2023)"
  ]
 },
 {
  "number": "21A",
  "title": "Maritime Affairs Division",
  "content": [
    "National planning, research and international aspects of inland water transport and coastal shipping within the same Province.",
    "Diverted cargo belonging to the Federal Government.",
    "Navigation and shipping, including coastal shipping but excluding shipping confined to one Province; safety of ports and regulation of matters relating to dangerous cargo.",
    "Light-houses, lightships, beacons and other safety provisions for shipping.",
    "Admiralty jurisdiction and offenses committed on the high seas.",
    "Declaration and delimitation of major ports and constitution and power of authorities in such ports.",
    "Mercantile marine development and rehabilitation; international shipping and maritime conferences; ratification of conventions; training of seamen; national shipping pool.",
    "Korangi Fisheries Harbour Authority, Karachi.",
    "Office for promotion of Deep Sea Fisheries Resources in the Exclusive Economic Zone.",
    "Fishing and fisheries beyond territorial waters.",
    "Quality Control Laboratory, Karachi.",
    "Marine Fisheries Research Laboratory, Karachi.",
    "Fisheries Training Centre/Deep Sea Fishing Vessel.",
    "Oceanography and hydrological research.",
    "Marine Biological Research Laboratory, Karachi.",
    "Welfare of seamen and Seamen Hostel, Karachi.",
    "Administrative functions under the Pakistan Maritime Zones Act, 2023 (XVIII of 2023)."
  ]
 },
 {
  "number": "23",
  "title": "National Food Security and Research Division",
  "content": [
    "Economic coordination and planning in respect of food; economic planning and policy making in respect of agriculture.",
    "Imports and exports control on food grains and foodstuffs; inspection, grading, analysis and shipment standards.",
    "Collection of statistics regarding production, consumption, prices, imports and exports of food grains.",
    "Coordination with aid and assistance agencies in the food sector.",
    "Pakistan Agricultural Research Council and other Federal agriculture research organizations.",
    "Matters related to FAO of the United Nations.",
    "Plant protection, pesticide import, aerial spray, plant quarantine, locust control, and locust warning organizations.",
    "Federal seed certification and registration.",
    "Standardization and import of fertilizer.",
    "Procurement of food grains (including sugar) from abroad, for Federal requirements, for inter-Provincial supplies, and for export/storage.",
    "Grading of agricultural commodities (other than food grains) for export.",
    "Administrative control of PASSCO.",
    "Preparation of basic plan for bulk allocation of food grains and foodstuffs.",
    "Price stabilization, procurement and issue prices of food grains and foodstuffs (including imports/exports/inter-provincial supplies).",
    "Agricultural Policy Institute.",
    "Animal quarantine departments and facilities nationwide.",
    "National Veterinary Laboratory, Islamabad.",
    "Laboratory for Detection of Drugs Residues in Animal Products at Karachi.",
    "Veterinary drugs, vaccines and animal feed additives (import/export and Federal procurement).",
    "Livestock, poultry and livestock products (import/export and national grading).",
    "Pakistan Dairy Development Company.",
    "Livestock and Dairy Development Board (LDDB).",
    "Fisheries Development Board (FDB).",
    "Pakistan Oil-Seed Department.",
    "International cooperation on agriculture and livestock.",
    "Administrative control of Agricultural Counselor’s Office at Rome, Italy.",
    "National Fertilizer Development Centre.",
    "Administrative control of Pakistan Central Cotton Committee.",
    "Pakistan Cotton Standard Institute."
  ]
 },
 {
  "number": "24",
  "title": "National Health Services, Regulations and Coordination Division",
  "content": [
    "Pakistan Medical and Dental Council.",
    "Pakistan Council for Nursing.",
    "College of Physicians and Surgeons.",
    "National Councils for Tibb and Homeopathy.",
    "Pharmacy Council of Pakistan.",
    "National associations in medical and allied fields such as Pakistan Red Crescent Society and TB Association.",
    "Border Health Services Pakistan.",
    "Drug Regulatory Authority of Pakistan.",
    "International aspects of medical facilities and public health, International Health Regulations, health and medical facilities abroad.",
    "National Institute of Health.",
    "National Emergency Health Services.",
    "Pakistan Medical Research Council.",
    "Health Services Academy, Islamabad.",
    "Coordination of Vertical Health Programmes including interaction with GAVI, EPI and the Global Fund for AIDS, TB, Hepatitis and Malaria.",
    "National Planning and Coordination in the field of health.",
    "Planning and Development Policies pertaining to Population Programmes in the country.",
    "Matters relating to National Trust for Population Welfare and National Institute of Population Studies.",
    "Mainstreaming population factor in development planning.",
    "Directorate of Central Warehouse and Supplies, Karachi.",
    "Human Organ Transplant Authority.",
    "Charitable endowments for Federal area.",
    "Medical and health services for Federal Government employees.",
    "Administrative control of the National Institute of Handicapped, Islamabad.",
    "Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad.",
    "Federal Medical and Dental College, Islamabad.",
    "Federal General Hospital, Islamabad.",
    "National Institute of Rehabilitative Medicine.",
    "District Population Welfare Office.",
    "Dealing and agreements with other countries and international organizations in matters relating to Population Planning Programs.",
    "Dealing and agreements with other countries and international organizations in the field of health, drugs and medical facilities abroad.",
    "Scholarships / fellowships, training courses in health from International Agencies such as W.H.O. and UNICEF.",
    "Federal Government Tuberculosis Centre, Rawalpindi.",
    "Shaikh Zayed Postgraduate Medical Institute, Lahore.",
    "Administrative functions in respect of the following laws:",
    "The Allied Health Professionals Council Act, 2022 (IX of 2022).",
    "The Pakistan Medical and Dental Council Act, 2022 (IV of 2023).",
    "The Pakistan Institute of Medical Sciences (PIMS) Act, 2023 (I of 2023)."
  ]
 },
 {
  "number": "25",
  "title": "National Heritage and Culture Division",
  "content": [
    "International agreements and assistance in the field of archaeology, national museums and historical monuments declared to be of national importance.",
    "Quaid-e-Azam Papers Wing.",
    "Pakistan Academy of Letters.",
    "Urdu Dictionary Board and Urdu Science Board.",
    "National and other languages used for official purposes.",
    "Quaid-e-Azam Academy.",
    "Aiwan-i-Iqbal and Iqbal Academy Pakistan.",
    "Quaid-e-Azam Mazar Management Board (QMMB).",
    "Quaid-e-Azam Memorial Fund.",
    "Naming of institutions in the name of Quaid-e-Azam and other high and distinguished personages.",
    "National Library of Pakistan.",
    "National Institute of Folk and Traditional Heritage of Pakistan (Lok Virsa).",
    "Pakistan National Council of Arts.",
    "Cultural pacts and protocols with other countries.",
    "Federal Government’s Artists’ Welfare Fund.",
    "Aiwan-e-Quaid Building."
  ]
 },
 {
  "number": "26",
  "title": "National Security Division",
  "content": [
    "Function as Secretariat of the National Security Committee (NSC).",
    "Convene meetings of the National Security Committee.",
    "Collect, coordinate and collate proposals and input from all relevant Ministries and organizations for consideration of the NSC.",
    "Formulation of comprehensive National Security Policy (NSP) for approval of the NSC, ensure implementation monitoring and review.",
    "Coordinate the implementation of strategies and policies approved by the NSC through relevant Ministries and organizations.",
    "Develop national narrative to promote the national security vision outlined in the NSP and to counter extremist ideologies.",
    "Provide administrative and financial management support to the Strategic Policy Planning Cell (SPPC) and coordinate all research and dialogues.",
    "Brief the Parliament and its Committees on national security related issues.",
    "Conduct national security dialogue with other countries in consultation with the Ministry of Foreign Affairs.",
    "Interact with counterpart National Security Councils of other countries.",
    "Organize Islamabad Security Dialogue on regular basis."
  ]
 },
 {
  "number": "27",
  "title": "Overseas Pakistanis and Human Resource Development Division",
  "content": [
    "National policy, planning and coordination regarding manpower development and employment promotion for intending overseas workers.",
    "Preparation of short and long-term programmes for manpower development and employment promotion abroad.",
    "Research into problems of overseas Pakistanis; promotion and coordination of measures for resolution and to strengthen ties with the homeland.",
    "Policy for linkages between worker training and international requirements.",
    "Linkage of training imparted at institutes like National Training Bureau and Pakistan Manpower Institute with manpower export efforts.",
    "Welfare of Pakistani emigrants abroad and their dependents in Pakistan.",
    "Periodic assessment, review and analysis of manpower resources and employment requirements overseas.",
    "Administrative control of Overseas Pakistanis Foundation.",
    "Special Selection Board for selection of Community Welfare Attaches for posting in Pakistan Missions abroad.",
    "Administration of:",
    "The Emigration Ordinance, 1979 (XVIII of 1979).",
    "The Control of Employment Ordinance, 1965 (XXXII of 1965).",
    "The Workers Welfare Fund Ordinance, 1971 (XXXVI of 1971).",
    "The Companies Profits (Workers Participation) Act, 1968 (XII of 1968).",
    "The Employees’ Old Age Benefits Act, 1976 (XIV of 1976).",
    "Administrative control of:",
    "Overseas Employment Corporation.",
    "Bureau of Emigration and Overseas Employment.",
    "Foreign Employment and Emigration.",
    "Administration of the Industrial Relations Act, 2012 (X of 2012), coordination of labour laws and the Industrial Relations Commission.",
    "Dealing and agreements with international organizations in the fields of labour and social security."
  ]
 },
 {
  "number": "28",
  "title": "Parliamentary Affairs Division",
  "content": [
    "Majlis-e-Shoora (Parliament), summoning of either House or both Houses or Joint sitting of Majlis-e-Shoora (Parliament) and prorogation thereof.",
    "Dissolution of the National Assembly.",
    "Liaison between the Divisions and Majlis-e-Shoora (Parliament) in respect of official and non-official business; priority of official business.",
    "Follow up of the assurances, promises and undertakings given by the Federal Government on the floor of the House with a view to their implementation by the Divisions concerned.",
    "Submission of Bills passed by Majlis-e-Shoora (Parliament) or by the National Assembly to President for his assent.",
    "Legislation pertaining to privileges of Majlis-e-Shoora (Parliament) and members of Majlis-e-Shoora (Parliament), salaries and allowances of the Chairman and Deputy Chairman of the Senate, Speaker and Deputy Speaker of the National Assembly and members of Majlis-e-Shoora (Parliament).",
    "Legislation pertaining to the Leader of the House and the Leader of the Opposition, provision of staff and other facilities for the Leader of the House.",
    "Rules of Procedure of either House or Joint Sitting of Majlis-e-Shoora (Parliament).",
    "Legislation pertaining to punishment of persons who refuse to give evidence or produce documents before committees of National Assembly or the Senate.",
    "Appointment and terms and conditions of Federal Parliamentary Secretaries.",
    "Legislative business relating to the Election Commission.",
    "Prime Minister's Public Affairs and Grievances Wing.",
    "Administrative functions in respect of the following laws:",
    "Members of Parliament (Salaries and Allowances) Act, 1974 (XXVII of 1974).",
    "Chairman and Speaker (Salaries, Allowances and Privileges) Act, 1975 (LXXXII of 1975).",
    "Deputy Chairman and Deputy Speaker (Salaries, Allowances and Privileges) Act, 1975 (LXXXIII of 1975).",
    "Members of Majlis-e-Shoora (Parliament) Immunities and Privileges Act, 2023 (XX of 2023)."
  ]
 },
 {
  "number": "29",
  "title": "Petroleum Division",
  "content": [
    "All matters relating to oil, gas and mineral at the national and international levels, including:",
    "Policy, legislation, planning regarding exploration, development and production.",
    "Import, export, refining, distribution, marketing, transportation and pricing of all kinds of petroleum and petroleum products.",
    "Matters bearing on international aspects.",
    "Federal agencies and institutions for promotion of special studies and development programmes.",
    "Geological Surveys.",
    "Administration of Regulation of Mines and Oil Fields and Mineral Development (Federal Control), Act, 1948 and rules made thereunder.",
    "Petroleum concessions agreements for land, off-shore and deep seas areas.",
    "Import of machinery, equipment, etc., for exploration and development of oil and natural gas.",
    "Administration of Marketing of Petroleum Products (Federal Control) Act, 1974 and the rules made thereunder.",
    "Matters relating to Federal investments and undertakings wholly or partly owned by the Government in the field of oil, gas and minerals, except those assigned to the Industries and Production Division.",
    "Administration of:",
    "Petroleum Products (Development Surcharges) Ordinance, 1961 and rules made thereunder.",
    "Natural Gas (Development Surcharges) Ordinance, 1967 and rules made thereunder.",
    "Esso Undertakings (Vesting) Ordinance, 1976.",
    "Hydrocarbon Development Institute of Pakistan Act, 2006 (I of 2006) and rules made thereunder.",
    "Coordination of energy policy, including measures for conservation of energy and energy statistics.",
    "Secretariat of National Energy Policy Committee.",
    "Chief Inspector of Mines, Islamabad."
  ]
 },
 {
  "number": "30",
  "title": "Planning, Development and Special Initiatives Division",
  "content": [
    "Preparation of comprehensive National Plan for the economic and social development of the country.",
    "Formulation, within the framework of the National Plan, of an annual plan and an annual development programme.",
    "Recommendations concerning orderly adjustments in the light of new needs, better information and changing conditions.",
    "Monitoring the implementation of all major development projects and programmes; identification of bottlenecks and initiation of remedial action.",
    "Evaluation of on-going and completed projects.",
    "Review and evaluation of the progress achieved in the implementation of the National Plan.",
    "Identification of regions, sectors and sub-sectors lacking adequate portfolio of projects and taking steps to stimulate preparation of sound projects.",
    "Continuous evaluation of the economic situation and coordination of economic policies.",
    "Organization of research in various sectors of the economy to improve the data base and information.",
    "Association with the Economic Affairs Division on matters of external assistance from discussion to signing.",
    "Development of cost and physical standards for project appraisal.",
    "National Logistics Cell.",
    "Administrative control of:",
    "Economists and Planners Group.",
    "Pakistan Institute of Development Economics.",
    "Pakistan Planning and Management Institute (PPMI).",
    "Jawaid Azfar Computer Center (JACC).",
    "Public Private Partnership Authority (P3A).",
    "China Pakistan Economic Corridor Authority (CPEC).",
    "Mechanized Construction Company Pakistan Limited (MCCPL).",
    "National Construction Company Pakistan Limited (NCCPL).",
    "Planning Division as Secretariat of the Planning Commission.",
    "Preparation of an overall integrated plan for development and improvement of statistics in Pakistan.",
    "Preparation of annual programmes in accordance with agreed priorities.",
    "Examination and clearance of budgetary proposals for statistical development.",
    "Formulation of policy regarding general statistics and adapting national systems accordingly.",
    "Coordination with Provincial/Federal bodies and international organizations on statistical matters.",
    "Evaluation and introduction of standard concepts, definitions and classifications in national statistics.",
    "In-service and foreign training programmes in statistics.",
    "Evaluation of computerized methods for statistical estimation.",
    "Clearance of statistical projects by different organizations.",
    "Preparation and release of publications on national statistics.",
    "Undertaking of national census and surveys.",
    "Administration of:",
    "The Industrial Statistics Act, 1942 (XIX of 1942).",
    "General Statistics (Reorganization) Act, 2011 (XIV of 2011).",
    "Agricultural Census, Population Census, Livestock Census.",
    "Collection and analysis of demographic, population and health statistics.",
    "Compilation of labour, manpower and employment statistics.",
    "Periodic assessment of manpower resources versus employment needs.",
    "Coordinate special initiatives assigned by the Prime Minister.",
    "Periodic review of Public Sector Development Program and recommendation of adjustments.",
    "Promoting private sector role through Public Private Partnerships.",
    "Administrative functions in respect of the National Logistics Corporation Act, 2023 (LII of 2023)."
  ]
 },
 {
    "number": "31",
    "title": "Omitted",
    "content": "Omitted vide SRO 1262(1)/2017 dated 20-12-2017."
  },
  {
    "number": "31A",
    "title": "Omitted",
    "content": "Omitted vide SRO 1025(1)/2020 dated 8th October, 2020."
  },
  {
    "number": "31AA",
    "title": "Poverty Alleviation and Social Safety Division",
    "content": [
      "Policies regarding social protection with objective to provide basic necessities of life, such as food, clothing, housing, education and medical relief, for all such citizens, as are permanently or temporarily unable to earn their livelihood on account of infirmity, sickness or unemployment.",
      "Policies and strategies regarding poverty alleviation with the objective of improving the quality of life of the poorest segments of society; monitoring implementation of such policies and strategies.",
      "Policies for mainstreaming the poverty alleviation and social protection concerns in the public sector expenditure.",
      "Establishment of various innovation challenges to design initiatives for poverty alleviation.",
      "Coordination with all relevant stakeholders including but not limited to concerned divisions and provincial governments for integration and synergizing of efforts and ensuring that all policies are made with a pro-poor focus.",
      "Working with non-government sector to design and implement pro-poor initiatives.",
      "Establishment of a time bound and output based Labour Advisory Council and implementation of the proposals thereof.",
      "Collection of Zakat and Usher, disbursement of Zakat and Usher to the Provinces and other areas as per formula approved by Council of Common Interests.",
      "Coordination with relevant ministries and provincial governments for poverty alleviation and social protection initiatives.",
      "Administration of:\n(i) Benazir Income Support Programme.\n(ii) Pakistan Bait-ul-Mal.",
      "Administrative matters of:\n(i) Trust for Voluntary Organizations.\n(ii) Pakistan Poverty Alleviation Fund.\n(iii) Centre for Social Entrepreneurship.\n(iv) Centre for Rural Economy.",
      "Poverty Alleviation Coordination Council."
    ]
  },
  {
    "number": "31B",
    "title": "Power Division",
    "content": [
      "Matters relating to development of power resources of the country.",
      "Matters relating to electric utilities.",
      "Liaison with international engineering organizations in power sector.",
      "Federal agencies and institutions for promotion of special studies in power sector.",
      "Electricity; Karachi Electric Supply Corporation and Pakistan Electric Agencies Limited.",
      "Omitted vide SRO 1986 (I)/2024 dated 05-12-2024.",
      "Private Power and Infrastructure Board.",
      "Administrative Control of Alternative Energy Development Board.",
      "Omitted vide SRO 939(1)/2019 dated 19-08-2019.",
      "National Energy Efficiency and Conservation Authority."
    ]
  },
  {
    "number": "32",
    "title": "Privatization Division",
    "content": [
      "Privatization policies.",
      "The Transfer of Managed Establishments Order, 1978 (P.O.12 of 1978).",
      "Administration of the Privatization Commission Ordinance, 2000 (LII of 2000).",
      "Negotiation with International organizations relating to the functions of Privatization in consultation with the Economic Affairs Division.",
      "Any item incidental or ancillary to the above."
    ]
  },
  {
    "number": "33",
    "title": "Railways Division",
    "content": [
      "All matters pertaining to Pakistan Railways.",
      "Movement and priority in respect of Defence traffic.",
      "Maintenance of railway lines for strategic reasons.",
      "Negotiations with international organizations and other countries and implementation of agreements, with them.",
      "Coordination of development projects of railways as a part of the national development programme.",
      "Standardization and specifications of materials and stores.",
      "Overall efficiency and safety of railways.",
      "Coordination of rail movements into and from Ports."
    ]
  },
  {
    "number": "34",
    "title": "Religious Affairs and Interfaith Harmony Division",
    "content": [
      "Pilgrimage beyond Pakistan; Muslim pilgrims visits to India.",
      "Ziarat and Umra.",
      "Welfare and safety of pilgrims and zairian.",
      "Administrative control of the Haj Directorate at Jeddah and dispensaries in Makkah and Medina.",
      "Islamic studies and research including holding of seminars, conferences, etc., on related subjects.",
      "Training and education of Ulemas and Khatibs etc.",
      "Error-free and exact printing and publishing of the Holy Quran.",
      "Exchange of visits of scholars of Islamic learning and Education, international conferences/seminars on Islamic subject and liaison with foreign and international bodies and institutions.",
      "Ruet-e-Hilal.",
      "Tabligh.",
      "Omitted Vide SRO 850(I)/2014, dated 25-09-2014.",
      "Observance of Islamic Moral Standards.",
      "Donations for religious purposes and propagation of Islamic Ideology abroad.",
      "Marriage and divorce, infants and minor's adoption.",
      "Auqaf.",
      "Omitted vide SRO 487(I)/2019 dated 23-04-2019.",
      "Policy and legislation with regard to interfaith harmony.",
      "International agreements and commitments in respect of all religious communities and implementation thereof.",
      "Representation of Pakistan at UN Sub-Commission on Prevention of Discrimination to Minorities.",
      "Minorities’ Welfare Fund.",
      "National Commission for Minorities.",
      "Evacuee Trust Property Board."
    ]
  },
  {
    "number": "35",
    "title": "Revenue Division",
    "content": [
      "Tax Policy.",
      "Tax administration.",
      "Avoidance of double Taxation Agreements with other countries.",
      "Administration of Customs and Excise Group, and Income Tax Group.",
      "The prosecution and defense of legal proceedings concerning the Revenue Division shall be conducted by the Revenue Division and Federal Board of Revenue."
    ]
  },
  {
    "number": "36",
    "title": "Science and Technology Division",
    "content": [
      "Establishment of science cities.",
      "Establishment of institutes and laboratories for research and development in the scientific and technological fields.",
      "Establishment of science universities as specifically assigned by the Federal Government.",
      "Planning, coordination, promotion and development of science and technology monitoring and evaluation of research and development works, including scrutiny of development projects and coordination of development programmes in this field.",
      "Promotion of applied research and utilization of results of research in the scientific and technological fields carried out at home and abroad.",
      "Guidance to the research institutions in the Federation as well as the provinces in the fields of applied scientific and technological research.",
      "Coordination of utilization of manpower for scientific and technological research.",
      "Promotion and development of industrial technology.",
      "Promotion of scientific and technological contacts and liaison nationally and internationally, including dealings and agreements with other countries and international organizations.",
      "Initiate promotional measures for establishment of venture capital companies for technological development and growth.",
      "Support to NGOs concerned with development of science and technology.",
      "Promotion of metrology Standards, Testing and Quality Assurance System.",
      "National Commission for Science and Technology.",
      "Pakistan Council of Scientific and Industrial Research.",
      "Omitted vide Cab: Div: Notification No.4-6/97-Min.I dated 3.3.1998.",
      "Omitted vide SRO 1434 (I)/2024 dated 11-09-2024.",
      "Omitted vide SRO 226(I)/2010 (F.No.4-4/2007-Min-I), dated 02.04.2010.",
      "Council for Works and Housing Research.",
      "Omitted vide SRO 226(I)/2010, dated 02.04.2010.",
      "Omitted vide SRO 226(I)/2010, dated 02.04.2010.",
      "Omitted vide SRO 634(1)/2016, dated 22.7.2016.",
      "Pakistan Science Foundation.",
      "National Institute of Electronics.",
      "Pakistan Council of Science and Technology.",
      "National Institute of Oceanography.",
      "Omitted vide SRO 226(I)/2010, dated 02.04.2010.",
      "Omitted vide SRO 226(I)/2010, dated 02.04.2010.",
      "STEDEC Technology Commercialization Corporation of Pakistan (Private) Limited.",
      "National University of Sciences and Technology.",
      "Pakistan Standards and Quality Control Authority (PSQCA).",
      "Prescription of standards and measures for quality control of manufactured goods.",
      "Establishment of standards of weights and measures.",
      "Development, deployment and demonstration of renewable sources of energy.",
      "Pakistan National Accreditation Council (PNAC).",
      "Pakistan Council of Renewable Energy Technologies (PCRET).",
      "COMSATS University, Islamabad.",
      "Pakistan Engineering Council (PEC).",
      "Omitted vide SRO1088 (I)/2011, dated 09.12.2011.",
      "Omitted vide SRO1088 (I)/2011, dated 09.12.2011.",
      "Pakistan Halal Authority.",
      "National University of Technology.",
      "Administrative functions in respect of the National Metrology Institute of Pakistan Act, 2022 (XIX of 2022)."
    ]
  },
  {
    "number": "37",
    "title": "Omitted",
    "content": "Omitted vide SRO 83(I)/2025 dated 4th February, 2025."
  },
  {
    "number": "38",
    "title": "Omitted",
    "content": "Omitted vide SRO 487(I)/2019 dated 23rd April, 2019."
  },
  {
    "number": "39",
    "title": "Omitted",
    "content": "Omitted vide SRO 1025(1)/2020 dated 8th October, 2020."
  },
  {
    "number": "236A",
    "title": "Special Investment Facilitation Council (SIFC) Division",
    "content": [
      "All secretarial work for the SIFC, Apex Committee of SIFC, Executive Committee of SIFC and inter-Ministerial working groups.",
      "Follow up and implementation of decisions and directives issued by the SIFC and all the bodies mentioned at entry 1.",
      "Coordination, monitoring and implementation of the investment proposals, MoUs and agreements with other countries, international agencies and forums.",
      "General coordination between the Federal Government and the Provinces in order to facilitate foreign and domestic investment in Pakistan.",
      "Coordination with the relevant Ministries, Divisions, Departments and Authorities of the Federal Government for investment facilitation.",
      "Coordinate and facilitate between Government, non-Government and private sector entities for promotion of investment and related activities, stakeholder and investment promotion strategies.",
      "Coordinate and facilitate all other tasks, assigned by SIFC in realm of the objectives defined for SIFC under the law."
    ]
  },
  {
    "number": "40",
    "title": "Water Resources Division",
    "content": [
      "Matters relating to development of water resources of the country.",
      "Indus Waters Treaty, 1960, and Indus Basin Works.",
      "Water and Power Development Authority.",
      "Liaison with international engineering organizations in water sector, such as International Commission on Large Dams, International Commission on Irrigation and Drainage and International Commission on Large Power Systems (Cigre).",
      "Federal agencies and institutions for promotion of special studies in water sector.",
      "Institute of Engineers, Pakistan.",
      "Administrative control of Tubewell Construction Company.",
      "Indus River System Authority (IRSA).",
      "Pakistan Trans-border Water Organization."
    ]
  },
  {
    "number": "410",
    "title": "Pakistan Council of Research in Water Resources",
    "content": [
      "Pakistan Council of Research in Water Resources."
    ]
  }
  ]
}
