[
  {
    "Type": "Rule",
    "Part": "C",
    "Rule Number": "15",
    "Title": "Reference to the Prime Minister",
    "Content": "(1) Subject to the provisions of rule 5(3), no order shall be issued without the approval of the Prime Minister in the following cases:\n(a) cases involving important policy or a departure from important policy;\nNote: Departure from policy includes departure from a previous decision of the Cabinet or the Prime Minister.\n(b) cases involving directions to a Governor under Article 145 and to a Provincial Government under Article 149;\n(c) cases where it is proposed that the Federal Government undertake the implementation of an international agreement relating to a subject in the provincial field;\n(d) cases of Awards-Decorations in recognition of gallantry and academic distinction;\n(e) cases relating to petitions addressed to the Prime Minister which are neither withheld under instructions for the transmission nor accepted for direct transmission to the Prime Minister;\n(f) cases relating to mercy petitions against sentences of death passed by Courts requiring the exercise of the President's prerogative of pardon;\n(g) cases enumerated in Schedule V-A; and\n(h) cases involving sanction for the prosecution of a holder of a post referred to in Schedule V-A.\n\n(2) A case submitted to the Prime Minister for his orders shall include a self-contained, concise, and objective summary stating the relevant facts and points for decision. This summary shall be prepared on the same lines as those prescribed in these rules for a Summary for the Cabinet, except that only one copy shall be required and it need not be printed. The summary shall include the specific recommendations of the Minister-in-Charge and shall be accompanied, where appropriate, by a draft communication.\n\n(3) Omitted vide Cabinet Division O.M. No.104/8/85-Min-I, dated 4-8-85.\n\n(4) In a case in which the Prime Minister’s orders are obtained through oral discussion by a Minister, Minister of State, Special Assistant to the Prime Minister, Deputy Chairman Planning Commission, Secretary, or any other officer of the Government, a written note containing a brief record of the discussion and the orders of the Prime Minister shall be submitted to the Prime Minister’s Office for his information.\n\n(5) The Prime Minister shall:\n(a) communicate to the President all decisions of the Cabinet relating to the administration of affairs of the Federation and proposals for legislation;\n(b) furnish such information relating to the administration of affairs of the Federation and proposals for legislation as the President may call for; and\n(c) if the President so requires, submit for the consideration of the Cabinet any matter on which a decision has been taken by the Prime Minister or a Minister but which has not been considered by the Cabinet.",
    "Page Number": "10"
  },
  {
    "Type": "Rule",
    "Part": "C",
    "Rule Number": "15A",
    "Title": "Reference to the President",
    "Content": "(1) Notwithstanding the provisions made in these rules, where in terms of any provision of the Constitution or under any other statutory provision any function is to be performed or any orders are required to be issued by the President, or where his specific approval is required, the Division concerned shall incorporate a paragraph to this effect in the summary entitled \"Summary for the Prime Minister.\"\n\nThe Prime Minister shall render his advice and submit the case to the President. After the President has seen and approved the case, it shall be returned to the Prime Minister. The cases to which this sub-rule applies are enumerated in Schedule V-B.\n\n(2) Where under any provision of the Constitution, any function is to be performed or any orders are to be issued by the President in his discretion, the Division concerned shall submit the case to the President through the Prime Minister in the form of a self-contained, concise and objective summary entitled \"Summary for the President.\"\n\nThis summary shall state the relevant facts and points for decision, and be prepared on the same lines as prescribed in these rules for a Summary for the Cabinet, except that only one copy will be required, which may not be printed.\n\nThis procedure shall not apply where the President has conveyed the decision to the Prime Minister for issuing orders in respect of cases to be decided in his discretion. The cases to which this sub-rule applies are enumerated in Schedule VI.\n\n(3) The cases and papers referred to in Schedule VII shall be submitted to the President for his information.",
    "Page Number": "11"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "16",
    "Title": "Cases to be brought before the Cabinet",
    "Content": "(1) The following cases shall be brought before the Cabinet:\n\n(a) Proposals for legislation, official or non-official, including money bills;\n\n(b) Promulgation and revocation of Ordinances;\n\n(c) The budgetary position and proposals before the presentation of an Annual Budget Statement and a Supplementary Budget Statement or an Excess Budget Statement under Articles 80 and 84;\n\n(d) Proposals for levy, abolition, remission, alteration or regulation of any tax and floatation of loans;\n\n(e) A reference to the Supreme Court for advice on a question of law under clause (1) of Article 186;\n\n(f) Generation of electricity and laying of inter-provincial transmission lines;\n\n(g) [Omitted vide S.R.O 368(1)/2010 dated 1st June, 2010.]\n\n(h) Proposals for signing of negotiated instruments with foreign countries and approval for ratification of the instruments:\n\nProvided that all proposals for initiation of negotiation and for entering into any cultural or other agreements with any foreign government shall, in the first instance, be approved in principle by the Minister-in-Charge of the Division concerned, and actual negotiations shall be initiated only after such approval.\n\nProvided further that decisions regarding the composition of all delegations, except those for which important briefs are required, to attend meetings of international bodies may be taken by mutual consultation between the Minister and the Minister for Finance, but the approval of the Prime Minister shall be obtained—\n\n(i) Where the delegation is sponsored by a Division under the direct charge of the Prime Minister or a Division or Divisions under the charge of the Minister for Finance.\n\n(ii) Where a Minister is proposed to be included in the delegation.\n\nProvided further that a decision regarding the opening of an honorary consulate abroad may be taken by the Foreign Affairs Division in consultation with the Commerce Division.\n\n(i) Important reports and documents required to be laid before the Assembly or Senate;\n\n(j) Cases involving a significant impact on political, economic and administrative policies.\n\nNote.—Cases of this nature shall first be brought to the notice of the Prime Minister by the Minister-in-Charge. The Prime Minister will decide whether any such case should be brought before the Cabinet.\n\n(k) Case which the Minister-in-Charge considers important enough for discussion in the Cabinet;\n\n(l) Other cases required to be referred to the Cabinet under the provisions of these rules;\n\n(m) Any case desired by the Prime Minister to be referred to the Cabinet;\n\n(n) Appointments required to be made by the Government under any law for the time being in force.\n\n(2) [Omitted vide S.R.O 623(I)/2021 (F.No.4-11/2019-Min-I), dated 27.5.2021.]",
    "Page Number": "12",
    "Footnotes": [
      {
        "Clause": "1(h)",
        "Note": "Substituted vide SRO 910 (1)/2017 dated 8-9-2017 (F.No.4-2/2016-Min-I)"
      },
      {
        "Clause": "2(n)",
        "Note": "Inserted vide S.R.O 623(I)/2021 (F.No.4-11/2019-Min-I), dated 27.5.2021"
      }
    ]
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "17",
    "Title": "Method of disposal of Cabinet cases",
    "Content": "(1) Cases referred to the Cabinet shall be disposed of--\n\n(a) by discussion at a meeting of the Cabinet; or\n\n(b) by circulation amongst Ministers; or\n\n(c) by discussion at a meeting of a committee of the Cabinet:\n\nProvided that the decisions of the Committee shall be ratified by the Cabinet unless the Cabinet has authorised otherwise.\n\nThe Secretary to the Cabinet (hereinafter referred to as the \"Cabinet Secretary\") shall, under the general or special orders of the Prime Minister, indicate the manner in which a case shall be disposed of.\n\n(2) Committees of the Cabinet may be constituted, and their terms of reference and membership laid down by the Cabinet or the Prime Minister. Such Committees may be standing or special committees; accordingly as they are appointed to deal with a class of cases or a specific case.\n\n(3) Upon consideration of a case in the Cabinet, the Cabinet, may constitute committees to further deliberate on the issue and suggest further course of action. The committee constituted under this sub-rule shall be distinct from the Cabinet Committees constituted under sub-rule (2) and, apart from the Cabinet members, may also have other members, as the Cabinet may deem appropriate:\n\nProvided that report or recommendations of such committees, as the case may be, shall invariably be presented before the Cabinet for consideration and a decision in the matter, if so required.",
    "Page Number": "13"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "18",
    "Title": "Manner of submission of Cabinet cases.",
    "Content": "(1) In respect of all cases to be submitted to the Cabinet, the Secretary of the Division concerned shall transmit to the Cabinet Secretary a concise, lucid and printed memorandum of the case (hereinafter referred to as the \"summary\"), giving the background and relevant facts, the points for decision and the recommendations of the Minister-in-Charge. In the event of views of the Division being different from those of the Minister-in-Charge, both views shall be included in the summary.\n\n(2) In the case of a proposed legislation to which approval is sought in principle, the summary shall bring out clearly the main issues to be legislated upon.\n\n(3) The summary shall be self-contained as far as possible not exceeding two printed pages and may include as appendices only such relevant papers as are necessary for proper appreciation of the case. The number of copies of the summary and the form in which it is to be drawn up shall be prescribed by the Cabinet Secretary.\n\n(4) Where a case concerns more than one Division, the summary shall not be submitted to the Cabinet unless it has been considered by all the Divisions concerned. In the event of a difference of opinion between them, the points of difference shall be clearly stated in the summary. A copy of the summary shall be sent by the sponsoring Division to the other Division(s) concerned simultaneously with its transmission to the Cabinet Division.\n\n(5) All draft Bills, Ordinances or Orders shall be submitted to the Cabinet after they have been scrutinized by the Law and Justice Division. No changes shall be made therein except in consultation with that Division.\n\n(6) No case for inclusion in the agenda of a meeting of the Cabinet shall be accepted unless it reaches the Cabinet Secretary at least seven clear days in advance of the meeting:\n\nProvided that, if a case is urgent and is required to be taken up at short notice, the Secretary concerned shall obtain the approval of the Prime Minister for its inclusion in the agenda before it is transmitted to the Cabinet Secretary.\n\n(7) It shall be the duty of the Cabinet Secretary to satisfy himself that the papers submitted by a Secretary are complete and in appropriate form. He may return the case until the requirements of the rules have been complied with. If the Cabinet Secretary is satisfied that the case does not merit consideration of the Cabinet, he may advise that the matter be placed before an appropriate forum or require it to be submitted to the Prime Minister.",
    "Page Number": "13"
  },
  {
    "Type": "Rule",
    "Part": "D",
    "Rule Number": "19",
    "Title": "Procedure regarding circulation of Cabinet cases",
    "Content": "(1) When a case is circulated to the Cabinet for recording opinion, the Cabinet Secretary shall specify the time by which opinions should be communicated to him. If a Minister does not communicate his opinion by that time, it shall be assumed that he accepts the recommendations contained in the summary.\n\n(2) On expiry of the specified time, the Cabinet Secretary shall submit the opinions received to the Prime Minister for decision.\n\n(3) If the Prime Minister directs that the case shall be discussed at a Cabinet meeting, the Cabinet Secretary shall circulate the opinions recorded by the Ministers, in the form of a supplementary summary.\n\n(4) Report made to the Cabinet of action taken on its decisions, and other cases submitted only for information, shall normally be disposed of by circulation.",
    "Page Number": "14"
  }
]
