{
  "part": "B",
  "title": "CONSULTATION AMONG DIVISIONS",
  "rules": [
    {
      "number": "8",
      "title": "Inter-Division procedure",
      "content": [
        {
          "clause": "(1)",
          "text": "When the subject of a case concerns more than one Division, the Division in charge shall be responsible for consulting the other Division concerned and no orders shall issue, nor shall the case be submitted to the Cabinet or the Prime Minister, until it has been considered by all the Divisions concerned, and their views obtained. Such consultation shall take place as early as may be practicable.",
          "provisos": [
            "Provided that in cases of urgency and with the approval of the Prime Minister, this requirement may be dispensed with, but the case shall at the earliest opportunity thereafter be brought to the notice of the other Divisions concerned."
          ]
        },
        {
          "clause": "(1A)",
          "text": "The Division should normally furnish its views to the referring Division within a fortnight of the receipt of reference. If more time is required because of the complicated nature of the case, the referring Division should invariably be informed of the position by the end of a fortnight indicating, simultaneously, the time by which the reply would be sent."
        },
        {
          "clause": "(2)",
          "text": "In the event of a difference of opinion between the Divisions concerned, the Minister primarily concerned shall try to resolve the difference in consultation with the other Ministers concerned. If no agreement is reached and the Minister primarily concerned desires to press the case, the case shall be submitted to the Prime Minister or, if the Prime Minister so desires, to the Cabinet.",
          "provisos": [
            "Provided that in a matter of urgency, the Minister primarily concerned may submit the case to the Prime Minister at any stage.",
            "Provided further that where the Prime Minister is the Minister-in-Charge, the final views of other Divisions concerned shall be obtained before the case is submitted to the Prime Minister."
          ]
        },
        {
          "clause": "(3)",
          "text": "When a case is referred by one Division to another for consultation, all relevant facts and the points necessitating the reference shall be clearly brought out. The reference should be complete in all respects to eliminate avoidable back references on the same issue(s). Similarly, replies given by the Division should also be complete in all respects and cover all the points raised by the referring Division."
        },
        {
          "clause": "(4)",
          "text": "Even where consultation is not required, a Division may, for purposes of information, pass copies of a communication received by it, or show a case, to such other Division as it considers would be interested in, or would profit by it.",
          "provisos": [
            "Provided that copies of classified documents shall be made and distributed only in accordance with the instructions issued by the Cabinet Division in accordance with rule 55(2).",
            "Provided further that copies of cypher telegrams received or dispatched by the Pakistan Crypto Centre shall be distributed in accordance with the standing orders issued by the Foreign Affairs Division in consultation with the Defence Division and the Cabinet Division."
          ],
          "references": [
            "Rule 55(2)",
            "Standing Orders – Foreign Affairs & Defence Divisions"
          ]
        },
        {
          "clause": "(5)",
          "text": "A Minister may ask to see a case of another Division if it is required for the disposal of a case in his Division. The Minister for Finance may ask to see a case of any Division in which a financial consideration is involved. While making such request, the Minister shall give reasons for which the case is called for and shall be dealt with under the general or special orders of the Minister-in-Charge of the other Division. If, for any reason, the case or relevant extracts from it, cannot be made available, the Minister of the Division shall explain the position to the Minister making the request or bring the matter to the notice of the Prime Minister, if necessary."
        },
        {
          "clause": "(6)",
          "text": "The Prime Minister may call for a case from any Division."
        },
        {
          "clause": "(7)",
          "text": "If a Minister desires any further action to be taken on the case of another Division, he shall take up the matter with the Minister of that Division."
        }
      ]
    },
    {
      "number": "9",
      "title": "Secretaries' Committee",
      "content": [
        {
          "clause": "(1)",
          "text": "There shall be a Secretaries' Committee to discuss matters referred to it by a Division, a Minister-in-Charge, the Prime Minister or the Cabinet, in which collective experience and collective wisdom of the senior officers could be consulted, to the benefit of the subject under consideration."
        },
        {
          "clause": "(2)",
          "text": "All cases, wherein two or more Divisions have different point of view, may be considered by the Secretaries' Committee for its resolution or firming up clear recommendations on the issues, before being submitted to the Prime Minister or the Cabinet."
        },
        {
          "clause": "(3)",
          "text": "All policy matters pertaining to the career progression, service structure and terms and conditions of civil servant may be placed before the Secretaries' Committee for eliciting views and recommendation before submission to the Prime Minister or the Cabinet."
        },
        {
          "clause": "(4)",
          "text": "The Cabinet Secretary, at least once in a quarter, shall present before the Cabinet a resume of the decisions and recommendations made by Secretaries' Committee on various issues."
        },
        {
          "clause": "(5)",
          "text": "In a matter discussed in the Secretaries' Committee, if the Secretary of a Division has agreed to a proposal, it shall not be necessary to consult his Division again on that proposal."
        },
        {
          "clause": "(6)",
          "text": "When a matter is referred to a Committee or working group and a Division is represented therein by an officer of or above the rank of Joint Secretary, the agreed decision of the Committee or working group shall be treated as final and shall not be subjected to further scrutiny in that Division.",
          "tag": "final_decision_clause"
        },
        {
          "clause": "(7)",
          "text": "The Secretaries' Committee shall meet at least once a month unless there are no items for discussion."
        },
        {
          "clause": "(8)",
          "text": "Other instructions regarding the submission of cases to the Secretaries' Committee shall be issued by the Cabinet Division."
        }
      ]
    },
    {
      "number": "10",
      "title": "Consultation with the Cabinet Division",
      "content": [
        {
          "clause": "(1)",
          "text": "No Division shall, without previous consultation with the Cabinet Division, issue or authorise the issue of any orders which involve,-",
          "sub_clauses": {
            "a": "the interpretation of these rules;",
            "b": "a change in the allocation of business between the various Divisions of a Ministry;",
            "c": "the strength, terms and conditions of service of the personal staff of Ministers, Ministers of State, Special Assistants to the Prime Minister and other dignitaries who enjoy the rank and status of a Minister or Minister of State.",
            "d": {
              "status": "omitted",
              "note": "Omitted vide SRO 1434(I)/2024 dated 11-09-24"
            }
          },
          "footnotes": [
            "SRO 1434(I)/2024 dated 11-09-24"
          ]
        },
        {
          "clause": "(2)",
          "text": "Proposals regarding any directions by the President to the Governor of a Province under clause (1) of Article 145 shall be submitted to the President by the Division concerned but a copy of the Presidential directive will be supplied to the Cabinet Division."
        },
        {
          "clause": "(3)",
          "text": "The Divisions concerned shall obtain clearance of the Cabinet Division to the proposals for the sending of delegations which are not in conformity with the procedure laid down by that Division regarding the categorization of international conferences.",
          "references": [
            "International Conference Categorization Procedures – Cabinet Division",
            "SRO 623(I)/2021"
          ],
          "footnotes": [
            "SRO 623(I)/2021"
          ]
        }
      ]
    },
    {
      "number": "11",
      "title": "Consultation with the Establishment Division",
      "content": [
        {
          "text": "No Division shall, without previous consultation with the Establishment Division, issue, or authorize the issue of, any orders, other than orders in pursuance of any general or special delegation made by the Establishment Division, which involve -",
          "sub_clauses": {
            "a": {
              "status": "omitted",
              "note": "Deleted vide Cabinet Division Memo. No.104/59/78-Min.I, dated 5-7-1979"
            },
            "b": {
              "status": "omitted",
              "note": "Deleted vide Cabinet Division Memo. No.104/59/78-Min.I, dated 5-7-1979"
            },
            "c": "Appointment to a post in BS-20 and above and equivalent whether by initial appointment or promotion or transfer.",
            "d": "a change in the terms and conditions of service of Federal civil servants;",
            "e": "a change in the statutory rights and privileges of any Federal Government servant;",
            "f": {
              "status": "omitted",
              "note": "Omitted vide SRO 246(I)/2001, dated 26.4.2001"
            },
            "g": {
              "status": "omitted",
              "note": "Omitted vide SRO 1434(I)/2024 dated 11-09-24"
            },
            "h": "the interpretation of rules and orders made by the Establishment Division;",
            "i": "rules for recruitment to any post or service, including the question of removing a post or service from the purview of the Federal Public Service Commission for the purposes of recruitment."
          },
          "footnotes": [
            "Cabinet Division Memo. No.104/59/78-Min.I, dated 5-7-1979",
            "SRO 246(I)/2001, dated 26.4.2001",
            "SRO 1434(I)/2024, dated 11-09-24"
          ]
        }
      ]
    },
    {
      "number": "12",
      "title": "Consultation with the Finance Division",
      "content": [
        {
          "clause": "(1)",
          "text": "No Division shall, without previous consultation with the Finance Division, authorise the issue of any orders, other than orders in pursuance of any general or special delegation made by the Finance Division, which will affect directly or indirectly the finances of the Federation or which in particular involve --",
          "sub_clauses": {
            "a": "relinquishment, remission or assignment of revenue, actual or potential, or grant of a guarantee against it;",
            "b": "expenditure for which no provision exists in the budget or for which no sanction exists;",
            "c": {
              "status": "omitted",
              "note": "Omitted vide Cabinet Division Notification No.4-11/91-Min-I dated 22.10.1991"
            },
            "d": "floatation of loan;",
            "e": "re-appropriation within budget grant;",
            "f": "alteration in the method of compilation of accounts, or of the budget estimates;",
            "g": "receipt or expenditure of foreign exchange unless already allocated;",
            "h": "a change in the terms and conditions of service of Government servants on their statutory rights and privileges, which have financial implications;",
            "i": "interpretation of rules made by the Finance Division;",
            "j": {
              "status": "omitted",
              "note": "Omitted vide Cabinet Division Notification No.4-14/98-Min.I dated 01.12.1998"
            }
          },
          "footnotes": [
            "Cabinet Division Notification No.4-11/91-Min-I dated 22.10.1991",
            "Cabinet Division Notification No.4-14/98-Min.I dated 01.12.1998"
          ]
        },
        {
          "clause": "(2)",
          "text": "No proposal to which the previous concurrence of the Finance Division is required shall, so long as concurrence is refused, be proceeded with. If a Minister cannot reach agreement with the Minister for Finance and desires to press the proposal, he shall submit it to the Prime Minister or, if the Prime Minister so desires, to the Cabinet. Formal orders shall not issue until the Finance Division has given its scrutiny to the details of the proposal, where no such details have been supplied with the proposal."
        },
        {
          "clause": "(3)",
          "text": "Except to the extent that power may have been delegated to the Divisions under the rules framed by the Finance Division, every order of an administrative Division conveying a sanction to be enforced in audit shall be communicated to the audit authorities through the Finance Division."
        }
      ]
    },
    {
      "number": "13",
      "title": "Consultation with the Foreign Affairs Division",
      "content": [
        {
          "text": "The Foreign Affairs Division shall, subject to orders in pursuance of any general or special delegation made by that Division, be consulted on all matters which affect the foreign policy of Pakistan, or the conduct of its foreign relations."
        }
      ]
    },
    {
      "number": "14",
      "title": "Consultation with the Law and Justice Division",
      "content": [
        {
          "clause": "(1)",
          "text": "The Law and Justice Division shall be consulted-",
          "sub_clauses": {
            "a": "on all legal questions arising out of any case;",
            "b": "on the interpretation of any law;",
            "c": "before the issue of or authorization of the issue of an order, rule, regulation, by-law, notification, etc. in exercise of statutory powers;",
            "d": {
              "status": "omitted",
              "note": "Deleted vide Cabinet Division No.104/10/76-Min, dated 26-3-1976"
            },
            "e": "before instituting criminal or civil proceedings in a court of law in which the Government is involved;",
            "f": "whenever criminal or civil proceedings are instituted against the Government at the earliest possible stage;",
            "g": "before the appointment of a legal adviser in any Division or any office or corporation under its administrative control and the Law and Justice Division will make its recommendations after consultation with the Attorney General."
          },
          "footnotes": [
            "Cabinet Division No.104/10/76-Min, dated 26-3-1976"
          ]
        },
        {
          "clause": "(1A)",
          "text": "A Division may, for compelling reasons for a particular case, engage a private counsel and for that purpose shall refer the case to Law and Justice Division which may, after consultation with the Attorney General, allow engagement of such counsel on payment of fee by the Division concerned."
        },
        {
          "clause": "(2)",
          "text": "No Division shall consult the Attorney General except through the Law and Justice Division and in accordance with the procedure laid down by that Division.",
          "proviso": "Provided that for the purpose of settlement of its disputes through arbitration at national and international level, the Division concerned may make direct consultation with the Attorney-General for Pakistan."
        },
        {
          "clause": "(3)",
          "text": "If there is disagreement between the views of the Attorney General and the Law and Justice Division, the case shall be submitted to the Minister for Law and Justice for opinion. If the Minister disagrees with the Attorney General, the case shall be referred to the Prime Minister for orders who may refer the matter to the Cabinet if he so desires."
        },
        {
          "clause": "(4)",
          "text": "For any proposed legislation, the Law and Justice Division shall be consulted in accordance with rules 27 to 30.",
          "references": [
            "Rule 27",
            "Rule 28",
            "Rule 29",
            "Rule 30"
          ]
        },
        {
          "clause": "(5)",
          "text": "Bills or Ordinances received from the Provincial Governments or Governors requiring assent or instructions of the President shall be examined in the Division concerned and shall be submitted to the President through the Law and Justice Division."
        }
      ]
    },
    {
      "number": "14A",
      "title": "Consultation on Federal Taxes and Levies",
      "content": [
        {
          "clause": "(1)",
          "text": "No Division shall, without prior consultation with the Revenue Division, propose or issue any order, policy, or regulation involving the imposition, abolition, remission, alteration, or regulation of federal taxes, duties, fees or levies."
        },
        {
          "clause": "(2)",
          "text": "Such consultation shall take place at the earliest possible stage of the policy formulation or proposal drafting process."
        }
      ],
      "footnotes": [
        "Inserted vide [relevant SRO or amendment, to be updated]"
      ]
    }
  ]
}
