{
  "part": "I",
  "title": "MISCELLANEOUS PROVISIONS",
  "rules": [
    {
      "number": "55",
      "title": "Protection and communication of official information",
      "content": "(1) Information acquired from official documents relating to official matters shall only be communicated by a government servant or, as the case may be, designated official to the press, to non-officials, or even to officials belonging to other government offices in accordance with the procedure laid down in section 3 of the Freedom of Information Ordinance, 2002 (XCVI of 2002).\n\n(2) Detailed instructions shall be issued by the Cabinet Division for the treatment and custody of official documents and information of a classified nature.\n\n(3) Ordinarily all official news and information shall be conveyed to the press and the public through the Press Information Department or the External Publicity Wing of the Information and Broadcasting Division. The manner in which this may be done shall be prescribed by general or special orders to be issued by the Information and Broadcasting Division.\n\n(4) Only Ministers and Secretaries, and such officers as may be authorized, shall act as official spokesmen of the Government. No statement involving foreign policy shall normally be made by a person (other than the Minister of State for Foreign Affairs and the Prime Minister) without prior consultation with the Foreign Affairs Division."
    },
    {
      "number": "56",
      "title": "Channels of Communications",
      "content": "(1) Except as provided in sub-rule (2), all correspondence with the Government of a foreign country or a Pakistan diplomatic mission abroad or a foreign mission in Pakistan or an international organization shall normally be conducted through the Foreign Affairs Division: Provided that by means of general or special orders to be issued by the Foreign Affairs Division, direct correspondence may be allowed under such conditions and circumstances as may be specified.\n\n(2) All requests to a foreign Government or an international organization for economic or technical assistance shall be made through the Economic Affairs Division, which shall correspond with the foreign Government, etc., in accordance with the prescribed channel. The Economic Affairs Division may allow, by general or special orders, such requests to be made direct.\n\n(3) Correspondence with Provincial Governments shall be conducted directly by the Division, in respect of the subjects allocated to them, subject to the provisions of rule 8, and it shall ordinarily be addressed to the Secretary of the Department concerned in the Provincial Government: Provided that under general or special orders to be issued by a Division, its Attached Department may be authorized to correspond directly with the Department of a Provincial Government under such conditions and circumstances as may be specified therein.\n\n(4) Copies of the correspondence with the Provincial Government in respect of the affairs of former and acceding States shall be endorsed to the States and Frontier Regions Division: Provided that Division may, by means of general or special orders, specify the class or classes of correspondence which shall be conducted through that Division.\n\n(5) All correspondence with the headquarters of the Defence Forces viz. General Headquarters, Naval Headquarters, Air Headquarters, or their subordinate formations, shall normally be conducted through the Defence Division: Provided that by means of general or special orders to be issued by the Defence Division, direct correspondence may be allowed under such conditions and circumstances as may be specified: Provided further that the provisions of this sub-rule shall not affect normal communications between a Service Commander and the Civil Authorities in his area or inter-departmental discussions in which Service representatives are required to take part."
    },
    {
      "number": "57",
      "title": "Relaxation",
      "content": "The Prime Minister may permit, where he considers it necessary, relaxation of the provisions of these rules in individual cases."
    },
    {
      "number": "58",
      "title": "Repeal",
      "content": "The Rules of Business, 1962 are hereby repealed: Provided that all rules, instructions and orders issued under the provisions of these Rules shall continue in force so far as applicable and with the necessary adaptations until altered, repealed or amended by the appropriate authority."
    }
  ]
}
