{
  "document": {
    "title": "RULES OF BUSINESS, 1973",
    "amended_date": "As Amended up to 4th February, 2025",
    "authority": "CABINET SECRETARIAT (Cabinet Division) Islamabad\n[Ministerial-1 Section]",
    "parts": [
      {
        "part": "A",
        "title": "GENERAL",
        "rules": [
          {
            "number": "1",
            "title": "Title and commencement",
            "content": "(1) These rules may be called the \"Rules of Business, 1973.\"\n\n(2) They shall come into force on the fourteenth day of August 1973."
          },
          {
            "number": "2",
            "title": "Definitions",
            "content": "(1) In these rules, unless there is anything repugnant in the subject or context:\n\n(i) \"Assembly\" means the National Assembly;\n\n(ii) \"Attached Department\" means a Department which has direct relation with a Division and has been declared as such by the Federal Government;\n\n(iii) \"business\" means all work done by the Federal Government;\n\n(iv) \"Cabinet\" means and consists of the Prime Minister and the Federal Ministers;\n\n(v) \"case\" means a particular matter under consideration and includes all papers relating to it and required to enable the matter to be disposed of, viz., correspondence and notes, and also any previous paper on the subject or subjects covered by it or connected with it;\n\n(vi) \"Division\" means a self-contained administrative unit responsible for the conduct of business of the Federal Government in a distinct and specified sphere and declared as such by the Federal Government;\n\n(vii) \"Federal Secretariat\" means the Divisions or the Ministries when referred to collectively;\n\n(viii) \"Gazette\" means the official Gazette of Pakistan;\n\n(ix) \"Government\" means the Federal Government;\n\n(x) \"Leader of the House\" means the Member of the Parliament appointed by the Prime Minister to regulate official business in the Assembly, the Senate or the Majlis-e-Shoora (Parliament) in joint sitting, as the case may be;\n\n[Substituted vide SRO 623(I)/2021 dated 27-05-2021]\n\n(xi) \"Local administration\" means the agency through which the President administers a territory subject to his direct administrative control;\n\n(xii) \"Member\" means a member of the Assembly or the Senate;\n\n(xiii) \"Minister\" means the Federal Minister-in-Charge of the Ministry to which a particular case pertains and includes a Minister without portfolio and a Minister of State;\n\n(xiv) \"Ministry\" means a Division or group of Divisions constituted as a Ministry;\n\n(xv) \"Majlis-e-Shoora (Parliament)\" shall have the same meaning as assigned thereto in Article 50 of the Constitution of the Islamic Republic of Pakistan;\n\n[Substituted vide SRO 623(I)/2021 dated 27-05-2021]\n\n(xvi) \"Provincial Government\" means the Government of a Province of Pakistan;\n\n(xvii) \"Schedule\" means a Schedule to these rules;\n\n(xviii) \"Secretary\" means the Secretary General, Principal Secretary, Secretary, Special Secretary or Acting Secretary to the Government of Pakistan in charge of a Division or a Ministry, and where there is no Secretary, the Additional Secretary, Senior Joint Secretary or Joint Secretary in charge of the Division or the Ministry;\n\n[Inserted vide S.R.O. 226(I)/2010 (F.No.4-4/2007-Min-I), dated 02-4-2010]\n\n[Inserted vide SRO 428 (I)/2018 dated 04-04-2018]\n\n(xix) \"Section\" means a basic working unit in a Division as determined by the Government;\n\n(xx) \"Subordinate Office\" means a Federal Government office other than a Ministry, Division or an Attached Department.\n\n(2) All words and expressions used in these rules but not defined, have the same meaning as in the Constitution of the Islamic Republic of Pakistan."
          },
          {
            "number": "3",
            "title": "Allocation of Business",
            "content": "(1) The Federal Secretariat shall comprise the Ministries and Divisions shown in Schedule I.\n\n(2) The Prime Minister may, whenever necessary, constitute a new Ministry consisting of one or more Divisions.\n\n(3) The business of government shall be distributed among the Divisions in the manner indicated in Schedule II:\n\nProvided that the distribution of business or the constitution of the Division may be modified from time to time by the Prime Minister.\n\n(4) The Prime Minister shall allocate amongst his Ministers the business of Government by assigning several Divisions specified in Schedule I to the charge of a Minister:\n\nProvided that a Division or a Ministry not so assigned shall be in the charge of the Prime Minister:\n\nProvided further that more than one Division may be assigned to a Minister."
          },
          {
            "number": "4",
            "title": "Organization of Divisions",
            "content": "(1) Each Division shall consist of a Secretary to Government and of such other officials subordinate to him as the Government may determine:\n\nProvided that the same person may be Secretary of more than one Division.\n\n(2) The Secretary shall be the official head of the Division and shall be responsible for its efficient administration and discipline and for the proper conduct of business assigned to the Division under rule 3(3) and for the due execution of the sanctioned policy.\n\n(3) The Secretary shall organize the Division into a number of working units to be known as Sections:\n\nProvided that a unit which does not conform to a Section may be organized otherwise than as a Section on a permanent basis, in consultation with the Establishment Division.\n\nNote: In the case of an extraordinary working unit such as a research cell or an Office of the Officer on Special Duty, it will be sufficient if the Establishment Division is informed of the composition of the unit.\n\n(4) The Attached Departments as allocated to the various Divisions are shown in Schedule III.\n\n(5) The business of Government, other than the business done in the Federal Secretariat or the Attached Departments, shall be conducted through such agencies and offices as the Prime Minister may determine from time to time.\n\n(6) There may be a Special Assistant or Special Assistants to the Prime Minister with such status and functions as may be determined by the Prime Minister."
          },
          {
            "number": "5(10)",
            "title": "Procedure when the Secretary submits a case to the Minister",
            "subrules": [
              {
                "content": "The Secretary submits a case to the Minister, who may either accept the Secretary's views or over-rule them."
              },
              {
                "content": "Normally, the Secretary defers to the Minister's decision and implements it."
              },
              {
                "content": "If the Secretary feels the decision is manifestly wrong and may cause injustice, he may record reasons and re-submit the case."
              },
              {
                "content": "If the Minister still adheres to the earlier decision, and the matter is important, the Secretary shall request referral to the Prime Minister."
              },
              {
                "content": "If the Minister does not refer the case, the Secretary shall directly submit it to the Prime Minister with the Minister’s observations."
              }
            ]
          },
          {
            "number": "6",
            "title": "Individual and collective responsibility",
            "content": "The Cabinet shall collectively be responsible for the advice tendered to, or the executive orders issued in the name of the President whether by an individual Minister or as a result of decision by the Cabinet; but the Minister shall assume primary responsibility for the disposal of business pertaining to his portfolio."
          },
          {
            "number": "7",
            "title": "Orders and instruments, agreements and contracts",
            "content": "(1) Subject to Article 173, all executive actions of the Government shall be expressed to be taken in the name of the President.\n(2) The officers listed in Schedule IV may authenticate by signature all orders and other instruments made and executed in the name of the President:\nProvided that in certain cases an officer may be so authorised for a particular occasion by order of the Prime Minister.\n(3) Instructions regarding the manner of authentication of orders and instruments in connection with the representation of Pakistan in foreign countries or at international conferences and of international agreements and treaties shall be issued by the Foreign Affairs Division.\n(4) Instructions for the making of contracts on behalf of the President and the execution of such contracts and all assurances of property shall be issued by the Law and Justice Division.",
            "note": "The use of the expression 'Federal Government' in relation to the Provincial Governments and 'Government of Pakistan' in relation to foreign Government shall be in order."
          }
        ]
      }
    ]
  }
}
